[
  {
    "description": "شرح وفوائد الحديث\nدل الحديث على أن النية معيار لتصحيح الأعمال، فحيث صلحت النية صلح العمل، وحيث فسدت فسد العمل، وإذا وجد العمل وقارنته النية فله ثلاثة أحوال: \n(الأول): أن يفعل ذلك خوفاً من الله تعالى وهذه عبادة العبيد. \n(الثاني): أن يفعل ذلك لطلب الجنة والثواب وهذه عبادة التجار. \n(الثالث): أن يفعل ذلك حياء من الله تعالى وتأدية لحق العبودية وتأدية للشكر، ويرى نفسه مع ذلك مقصراً، ويكون مع ذلك قلبه خائفاً لأنه لا يدري هل قبل عمله مع ذلك أم لا، وهذه عبادة الأحرار، وإليها أشار رسول الله ﷺ لما قالت له عائشة رضي الله عنها حين قام من الليل حتى تورمت قدماه: يا رسول الله! أتتكلف هذا وقد غفر الله لك ما تقدم من ذنبك وما تأخر؟قال: (أفلا أكون عبداً شكوراً؟). فإن قيل: هل الأفضل العبادة مع الخوف أو مع الرجاء؟. قيل: قال الغزالي رحمه الله تعالى: العبادة مع الرجاء أفضل، لأن الرجاء يورث المحبة، والخوف يورث القنوط. \nوهذه الأقسام الثلاثة في حق المخلصين، واعلم أن الإخلاص قد يعرض له آفة العجب، فمن أعجب بعمله حبط عمله، وكذلك من استكبر حبط عمله. \nالحال الثاني: أن يفعل ذلك لطلب الدنيا والآخرة جميعها، فذهب بعض أهل العلم إلى أن عمله مردود واستدل بقوله ﷺ في الخبر الرباني: «يقول الله تعالى: أنا أغنى الشركاء فمن عمل عملاً أشرك فيه غيري فأنا بريء منه ». \nوإلى هذا ذهب الحارث المحاسبي في كتاب « الرعاية » فقال: الإخلاص أن تريده بطاعته ولا تريد سواه. والرياء نوعان: أحدهما: لا يريد بطاعته إلا الناس والثاني: أن يريد الناس ورب الناس، وكلاهما محبط للعمل، ونقل هذا القول الحافظ أبو نُعيم في «الحلية »عن بعض السلف، واستدل بعضهم على ذلك أيضاً بقوله تعالى: ( الجَّبار الُمتَكِّبرُ سُْبحَان الله عَمّا يُشْركوْنَ ) (الحشر: 23)، فكما أنه تكبر عن الزوجة والولد والشريك، تكبر أن يقبل عملاً أشرك فيه غيره، فهو تعالى أكبر، وكبير، ومتكبر. \nوقال السمرقندي رحمه الله تعالى: ما فعل لله قُِبلَ وما فعل من أجل الناس رُدَّ. ومثال ذلك من صلى الظهر مثلاً وقصد أداء ما فرض الله تعالى عليه ولكنه طول أركانه وقراءتها وحسَّن هيئتها من أجل الناس، فأصل الصلاة مقبول، وأما طوله وحسنه من أجل الناس فغير مقبول لأنه قصد به الناس. \nوسئل الشيخ عز الدين ابن عبد السلام: عمن صلى فطول صلاته من أجل الناس؟ فقال: أرجو أن لا يحبط عمله هذا كله إذا حصل التشريك في صفة العمل، فإن حصل في أصل العمل بأن صلى الفريضة من أجل الله تعالى والناس، فلا تقبل صلاته لأجل التشريك في أصل العمل، وكما أن الرياء في العمل يكون في ترك العمل. قال الفضيل بن عياض: ترك العمل من أجل الناس رياء والعمل من أجل الناس شرك، والاخلاص ان يعافيك الله منهما. \nومعنى كلامه رحمه الله تعالى أن من عزم على عبادة وتركها مخافة أن يراها الناس، فهو مُراءٍ لأنه ترك العمل لأجل الناس، أما لو تركها ليصليها في الخلوة فهذا مستحب إلا أن تكون فريضة، أو زكاة واجبة، أو يكون عالماً يقتدى به، فالجهر بالعبادة في ذلك أفضل، وكما أن الرياء محبط للعمل كذلك التسميع، وهو أن يعمل لله في الخلوة ثم يحدث الناس بما عمل، قال ﷺ: « من سمع سمع الله به ومن راءى راءى الله به ».\nقال العلماء: فإن كان عالماً يقتدى به وذكر ذلك تنشيطاً للسامعين ليعملوا به فلا بأس. قال المرزباني، رحمه الله تعالى عليه: يحتاج المصلى إلى اربع خصال حتى ترفع صلاته: حضور القلب، وشهود العقل، وخضوع الأركان، وخشوع الجوارح، فمن صلَّى بلا حضور قلب فهو مصلٍ لاهٍ، ومن صلى بلا شهود عقل فهو مصل ساهٍ، ومن صلى بلا خضوع الجوارح فهو مصل خاطىء، ومن صلى بهذه الأركان فهو مصلٍ وافٍ. \nقوله ﷺ: « إنما الأعمال بالنيات » أراد بها أعمال الطاعات دون أعمال المباحات، قال الحارث المحاسبي: الإخلاص لا يدخل في مباح، لأنه لا يشتمل على قربة ولا يؤدي إلى قربة، كرفع البنيان لا لغرض الرعونة، أما إذا كان لغرض كالمساجد والقناطر والأربطة فيكون مستحباً. قال: ولا إخلاص في محرم ولا مكروه، كمن ينظر إلى ما لا يحل له النظر إليه، ويزعم أنه ينظر إليه ليتفكر في صنع الله تعالى، كالنظر إلى الأمرد، وهذا لا إخلاص فيه بل لا قربة البتة، قال: فالصدق في وصف العبد في استواء السر والعلانية والظاهر والباطن، والصدق يتحقق بتحقق جميع المقامات والأحوال حتى إن الإخلاص يفتقر إلى الصدق، والصدق لا يفتقر إلى شيء. لأن حقيقة الإخلاص هو إرادة الله تعالى بالطاعة، فقد يريد الله بالصلاة ولكنه غافل عن حضور القلب فيها، والصدق هو إرادة الله تعالى بالعبادة مع حضور القلب إليه، فكل صادق مخلص، وليس كل مخلص صادقاً، وهو معنى الاتصال والانفصال، لأنه انفصل عن غير الله واتصل بالحضور بالله، وهو معنى التخلي عما سوى الله والتحلي بالحضور بين يدي الله سبحانه وتعالى. \nقوله ﷺ: « إنما الأعمال » يحتمل: إنما صحة الأعمال أو تصحيح الأعمال، أو قبول الأعمال، أو كمال الأعمال، وبهذا أخذ الإمام أبو حنيفة رحمه الله تعالى، ويستثنى من الأعمال ما كان قبيل التروك كإزالة النجاسة، ورد الغصوب والعواري، وإيصال الهدية وغير ذلك، فلا تتوقف صحتها على النية المصححة، ولكن يتوقف الثواب فيها على نية التقرب، ومن ذلك ما إذا أطعم دابته، إن قصد بإطعامها امتثال أمر الله تعالى فإنه يثاب، وإن قصد بإطعامها حفظ المالية فلا ثواب، ذكره القرافي، ويستثنى من ذلك فرس المجاهد، إذا ربطها في سبيل الله فإنها إذا شربت وهو لا يريد سقيها أثيب على ذلك كما في صحيح البخاري، وكذلك الزوجة وكذلك إغلاق الباب وإطفاء المصباح عند النوم إذا قصد به امتثال أمر الله أثيب وإن قصد أمراً آخر فلا. \nواعلم أن النية لغة: القصد، يقال نواك الله بخير: أي قصدك به. والنية شرعاً: قصد الشيء مقترناً بفعله، فإن قصد وتراخى عنه فهو عزم، وشرعت النية لتمييز العادة من العبادة أو لتمييز رتب العبادة بعضها عن بعض، مثال الأول: الجلوس في المسجد قد يقصد للاستراحة في العادة، وقد يقصد للعبادة بنية الاعتكاف، فالمميز بين العبادة والعادة هو النية، وكذلك الغسل: يقصد به تنظيف البدن في العادة، وقد يقصد به العبادة فالمميز هو النية وإلى هذا المعنى أشار النبي ﷺ حين سئل عن الرجل يقاتل رياء ويقاتل حمية ويقاتل شجاعة، أي ذلك في سبيل الله تعالى؟ فقال: « من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله تعالى » ومثال الثاني وهو المميز رتب العبادة، كمن صلى أربع ركعات قد يقصد إيقاعها عن صلاة الظهر وقد يقصد إيقاعها عن السنن فالمميز هو النية، وكذلك العتق قد يقصد به الكفارة وقد يقصد به غيرها كالنذر ونحوه، فالمميز هو النية. \nوفي قوله ﷺ: « وإنما لكل امرىء ما نوى » دليل على أنه لا تجوز النيابة في العبادات، ولا التوكيل من نفس النية، وقد استثني من ذلك تفرقة الزكاة وذبح الأضحية، فيجوز التوكيل فيهما في النية والذبح، والتفرقة مع القدرة على النية. وفي الحج: لا يجوز ذلك مع القدرة ودفع الدين، أما اذا كان على جهة واحدة لم يحتج إلى نية، وإن كان على جهتين كمن عليه ألفان بأحدهما رهن فإدى ألفاً قال جعلته عن ألف الرهن، صدق، فإن لم ينو شئياً حالة الدفع، ثم نوى بعد ذلك، وجعله عما شاء وليس لنا نية تتأخر عن العمل وتصح إلا هنا. \nقوله ﷺ: « فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ». \nأصل المهاجرة المجافاة والترك، فاسم الهجرة يقع على رموز: \nالأولى: هجرة الصحابة رضي الله عنهم من مكة إلى الحبشة حين آذى المشركون رسول الله ﷺ، ففروا منه إلى النجاشي، وكانت هذه بعد البعثة بخمس سنين، قاله البيهقي. \nالهجرة الثانية: من مكة إلى المدينة وكانت هذه بعد البعثة بثلاث عشرة سنة، وكان يجب على كل مسلم بمكة أن يهاجر إلى رسول الله ﷺ إلى المدينة، وأطلق جماعة أن الهجرة كانت واجبة من مكة إلى المدينة، وهذا ليس على إطلاقه فإنه لا خصوصية للمدينة، وإنما الواجب الهجرة إلى رسول الله صلى عليه وسلم قال ابن العربي: قسم العلماء رضي الله عنهم الذهاب في الأرض هرباً وطلباً، فالأول ينقسم إلى ستة أقسام: \n(الأول): الخروج من دار الحرب إلى دار الإسلام وهي باقية إلى يوم القيامة، والتي انقطعت بالفتح في قوله ﷺ: « لا هجرة بعد الفتح ». هي القصد إلى رسول الله صلى عليه وسلم حيث كان. \n(الثاني): الخروج من أرض البدعة، قال ابن القاسم: سمعت مالكاً يقول: لا يحل لأحد أن يقيم بأرض يُسَبُ فيها السلف. \n(الثالث): الخروج من أرض يغلب عليها الحرام، فإن طلب الحلال فريضة على كل مسلم. \n(الرابع): الفرار من الأذية في البدن، وذلك فضل من الله تعالى أرخص فيه، فإذا خشي على نفسه في مكان فقد أذن الله تعالى له في الخروج عنه، والفرار بنفسه يخلصها من ذلك المحذور، وأول من فعل ذلك إبراهيم عليه السلام حيث خاف من قومه فقال: {إٍنًّي مُهَاجِر ُ إِلى رَبًّي } [العنكبوت: 26]. وقال تعالى مخبراً عن موسى عليه السلام: {فَخَرَجَ مِنْهَا خَائِفَاَ يَتَرَقَّب ُ} [القصص: 21]. \n(الخامس): الخروج خوف المرض في البلاد الوخمة، إلى الأرض النزهة، وقد أذن ﷺ للعرنيين في ذلك حين استوخموا المدينة أن يخرجوا إلى المرج. \n(السادس) الخروج خوفاً من الأذية في المال، فإن حرمة مال المسلم كحرمة دمه. \nوأما قسم الطلب، فإنه ينقسم إلى عشرة: طلب دين وطلب دنيا، وطلب الدين ينقسم إلى تسعة أنواع: \n(الأول) سفر العبرة قال الله تعالى: {أَوَ لَمْ يَسِيْروُا فِي الأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذينَ مِنْ قَبْلهِم } [الروم: 9]. وقد طاف ذو القرنين في الدنيا ليرى عجائبها. \n(الثاني): سفر الحج. \n(الثالث): سفر الجهاد. \n(الرابع): سفر العبرة المعاش. \n(الخامس): سفر التجارة والكسب الزائد على القوت، وهو جائز لقوله تعالى: {لَيْسَ عَلْيكُمْ جُنَاحُ أَنْ تَبْتغُوا فَضْلاً مِنْ رَبَّكم } [البقرة: 198]. \n(السادس): طلب العلم. \n(السابع): قصد البقاع الشريفة، قال ﷺ: «لا تشد الرحال إلا إلى ثلاثة مساجد ». \n(الثامن): قصد الثغور للرباط بها. \n(التاسع): زيارة الإخوان في الله تعالى، قال ﷺ: « زار رجل أخاً له في قرية، فأرسل الله ملكاً على مدرجته. فقال: أين تريد؟ قال: أريد أخاً لي في هذه القرية، فقال: هل له عليك من نعمة تؤديها قال: لا، إلا أنني أحبه في الله تعالى قال: فإني رسول الله إليك بأن الله أحبك كما أحببته ». رواه مسلم. وغيره. \nالثالثة: هجرة القبائل إلى رسول الله ﷺ ليتعلموا الشرائع ويرجعوا إلى قومهم فيعلموهم. \nالرابعة: هجرة من أسلم من أهل مكة ليأتي النبي ﷺ ثم يرجع إلى قومه. \nالخامسة: الهجرة من بلاد الكفر إلى بلاد الإسلام، فلا يحل للمسلم الإقامة بدار الكفر، قال الماوردي: فإن صار له بها أهل وعشيرة، وأمكنة إظهار دينه، لم يجز له أن يهاجر، لأن المكان الذي هو فيه قدر دار إسلام. \nالسادسة: هجرة المسلم أخاه فوق ثلاثة، بغير سبب شرعي، وهي مكروهة في الثلاثة، وفيما زاد حرام إلا لضرورة. \nالسابعة: هجرة الزوج الزوجة إذا تحقق نشوزها قال تعالى {واهْجُرُوهُنَّ فِي اَلمَضَاجِع ِ} [ النساء: 34]. ومن ذلك هجرة أهل المعاصي في المكان، والكلام، وجواب السلام وابتداؤه. \nالثامنة: هجرة ما نهى الله عنه، وهي أعم الهجر. \nقوله ﷺ: « فمن كانت هجرته إلى الله ورسوله »: أي نية وقصداً فهجرته إلى الله ورسوله حكماً وشرعاً. \n« ومن كانت هجرته إلى دنيا يصيبها.. الخ » نقلوا أن رجلاً هاجر من مكة إلى المدينة لا يريد بذلك فضيلة الهجرة وإنما هاجر ليتزوج امرأة تسمى أم قيس، فسمي مهاجر أم قيس. فإن قيل النكاح من مطلوبات الشرع فْلمَ كان من مطلوبات الدنيا؟ قيل في الجواب: إنه لم يخرج في الظاهر لها، وإنما خرج في الظاهر للهجرة، فلما أبطن خلاف ما أظهر استحق العتاب واللوم، وقيس بذلك من خرج في الصورة الظاهرة لطلب الحج وقصد التجارة وكذلك الخروج لطلب العلم إذا قصد به حصول رياسة أو ولاية. \nقوله ﷺ: « فهجرته إلى ما هاجر إليه » يقتضي أنه لا ثواب لمن قصد بالحج التجارة والزيارة، وينبغي حمل الحديث على ما إذا كان المحرك الباعث له على الحج إنما هو التجارة، فإن كان الباعث له الحج فله الثواب، والتجارة تبع له إلا أنه ناقص الأجر عمن أخرج نفسه للحج، وإن كان الباعث له كليهما فيحتمل حصول الثواب لأن هجرته لم تتمخص للدنيا، ويحتمل خلافه لأنه قد خلط عمل الآخرة بعمل الدنيا، لكن الحديث رتب فيه الحكم على القصد المجرد، فأما من قصدهما لم يصدق عليه أنه قصد الدنيا فقط، والله سبحانه وتعالى أعلم.",
    "hadith": "الحديث الأول\n\nعن أمير المؤمنين أبي حفص عمر بن الخطاب (رضي الله عنه) قال: سمعت رسول الله ﷺ يقول: \"إنما الأعمال بالنيات وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها، فهجرته إلى ما هاجـر إليه\". (رواه إماما المحدّثين: أبو عبد الله محمـد بن إسماعيل بن إبراهيم بن المغيرة بن بردزبه البخاري الجعفي، وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري في صحيحيهما اللذين هما أصح الكتب المصنفة)."
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: أخبرني عن الإيمان: الإيمان في اللغة: هو مطلق التصديق، وفي الشرع: عبارة عن تصديق خاص، وهو التصديق بالله، وملائكته وكتبه، ورسله، وباليوم الآخر، وبالقدر خيره وشره. وأما الإسلام فهو عبارة عن فعل الواجبات، وهو الانقياد إلى عمل الظاهر. قد غاير الله تعالى بين الإيمان والإسلام كما في الحديث، قال الله تعالى: {قَالَتِ الأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤِْمُنوا وَلَكِنْ قُولُوا أَسْلَمْنَا } [الحجرات: 14].وذلك أنَّ المنافقين كانوا يصلون ويصومون ويتصدقون، وبقلوبهم ينكرون، فلما ادَّعوا الإيمان كذَّبَهم الله تعالى في دعواهم الإيمان لإنكارهم بالقلوب، وصدقهم في دعوى الإسلام لتعاطيهم إياه. وقال الله تعالى: {إِذا جاءك المنافقون قالوا نشهدُ إنكَ لَرَسُولُ اللهِ واللهُ يعلمُ إنَّك لرسولُهُ واللهُ يَشْهَدُ إنَّ المنافقينَ لكَاذبون َ} [المنافقون: 1]. أي في دعواهم الشهادة بالرسالة مع مخالفة قلوبهم، لأن ألسنتهم لم تواطىء قلوبهم، وشرط الشهادة بالرسالة: أن يواطىء اللسان القلب فلما كذبوا في دعواهم بَّين الله تعالى كذبهم، ولما كان الإيمان شرطاً في صحة الإسلام استثنى الله تعالى من المؤمنين المسلمين قال الله تعالى: { فأخرجْنا مَنْ كَانَ فيها مِنَ المؤمنينَ فما وَجَدْنَا فيها غير بَيْتٍ مِنَ المسِْلمِينَ } [الذاريات: 35- 36] فهذا استثناء متصل لما بين الشروط من الاتصال ولهذا سمى الله تعالى الصلاة: إيماناً: قال الله تعالى: { وََمَا كَانَ اللهُ ليضيع إيمانكم } [البقرة: 143]. وقال تعالى: {ما كنت تدري ما الكتاب ولا الإيمان } [الشورى: 52] أي الصلاة. \nقوله ﷺ: « وتؤمن بالقدر خيره وشره » بفتح الدال وسكونها لغتان، ومذهب أهل الحق: إثبات القدر، ومعناه أن الله سبحانه وتعالى قدر الأشياء في القدم، وعلم سبحانه وتعالى أنها ستقع في أوقات معلومة عنده سبحانه وتعالى، وفي أمكنة معلومة وهي تقع على حسب ما قدره الله سبحانه وتعالى. واعلم أن التقادير أربعة: \n(الأول) التقدير في العلم ولهذا قيل: العناية قبل الولاية، والسعادة قبل الولادة، واللواحق مبنية على السوابق، قال الله تعالى {يؤفك عنه من أُفِك َ} [الذاريات: 9] أي يصرف عن سماع القرآن وعن الإيمان به في الدنيا من صرف عنه في القدم، قال رسول الله ﷺ: « لا يهلك الله إلا هالكاً » أي من كتب في علم الله تعالى أنه هالك. \n(الثاني) التقدير في اللوح المحفوظ، وهذا التقدير يمكن أن يتغير قال الله تعالى: {يمحو الله ما يشاءُ ويثبت وعنده أم الكتاب } [الرعد: 39] وعن ابن عمر رضي الله تعالى عنهما أنه كان يقول في دعائه: « اللهم إن كنت كتبتني شقياً فامحني واكتبني سعيداً ». \n(الثالث) التقدير في الرحم، وذلك أن الملك يؤمر بكتب رزقه وأجله وشقي أو سعيد. \n(الرابع ) التقدير وهو سوق المقادير إلى المواقيت، والله تعالى خلق الخير والشر وقدر مجئيه إلى العبد في أوقات معلومة.و الدليل على أن الله تعالى خلق الخير والشر قوله تعالى: { إن المجرمين في ضلال وَسُعُرُ * يوم يُسحَبون في النار على وجوهِهمْ ذوقوا مَسَّ سَقَر * إنَّا كلَّ شي خلقناهُ بقَدَر ِ} [القمر 47-49] نزلت هذه الأية في القدرية، يقال لهم ذلك في جهنم، وقال تعالى { قل أعوذ برب الفلق * من شر ما خلق } [الفلق 1-2]. وهذا القسم إذا حصل اللطف بالعبد صرف عنه قبل أن يصل إليه. \nوفي الحديث: « إن الصدقة وصلة الرحم تدفع ميتة السوء وتقلبه سعادة ». \nوفي الحديث: « إن الدعاء والبلاء بين السماء والأرض يقتتلان، ويدفع الدعاء البلاء قبل أن ينزل ». \nوزعمت القدرية: أن الله تعالى لم يقدر الأشياء في القدم، ولا سبق علمه بها، وأنها مستأنفة، وأنه تعالى يعلمها بعد وقوعها، وكذبوا على الله سبحانه وتعالى جلَّ عن إقوالهم الكاذبة وتعالى علواً كبيراً، وهؤلاء انقرضوا وصارت القدرية في الأزمان المتأخرة يقولون: الخير من الله والشر من غيره، تعالى الله عن قولهم، وصح عنه ﷺ أنه قال: « القدرية مجوس هذه الأمة ». سماهم مجوساً لمضاهاة مذهبهم مذهب المجوس، وزعمت الثنوية أن الخير من فعل النور والشر من فعل الظلمة فصاروا ثنوية، كذلك القدرية يضيفون الخير إلى الله والشر إلى غيره وهو تعالى خالق الخير والشر. \nقال إمام الحرمين في كتاب «الإرشاد » إن بعض القدرية تقول: لسنا بقدرية بل أنتم القدرية لاعتقادكم أخبار القدر، ورد على هؤلاء الجهلة بأنهم يضيفون القدر إلى أنفسهم، ومن يدعي الشر لنفسه ويضيفه إليها أولى بأن ينسب إليه ممن يضيفه لغيره وينفيه عن نفسه. \nقوله ﷺ: فأخبرني عن الإحسان قال: « الأحسان أن تعبد الله كأنك تراه » وهذا مقام المشاهدة لأن من قدر أن يشاهد الملك استحى أن يلتفت إلىغيره في الصلاة وأن يشغل قلبه بغيره ومقام الإحسان مقام الصديقين وقد تقدم في الحديث الأول الإشارة إلى ذلك. \nقوله ﷺ: «فإنه يراك » غافلاً إن غفلت في الصلاة وحدثت النفس فيها. \nقوله ﷺ: فأخبرني عن الساعة فقال: « ما المسؤول عنها بأعلم من السائل » هذا الجواب على أنه ﷺ كان لا يعلم متى الساعة؟ بل علم الساعة مما استأثر الله تعالى به، قال الله تعالى: { إن الله عنده علم الساعة } [لقمان: 34]. وقال تعالى: {ثقلت في السماوات والأرض، لا تأتيكم إلا بغتة } [الإعراف: 187].وقال تعالى: { وما يدريك لعل الساعة تكون قريباً }[الأحزاب: 63]. \nومن ادعى أن عمر الدنيا سبعون ألف سنة وأنه بقي منها ثلاثة وستون ألف سنة فهو قول باطل حكاه الطوخي في «أسباب التنزيل » عن بعض المنجمين وأهل الحساب، ومن ادعى أن عمر الدنيا سبعة آلاف سنة فهذا يسوف على الغيب ولا يحل اعتقاده. \nقوله ﷺ: فأخبرني عن أماراتها قال: « أن تلد الأمة ربتها » الأمار والأمارة بإثبات التاء وحذفها لغتان، وروي ربها وربتها، قال الأكثرون هذا إخبار عن كثرة السراري وأولادهن، فإن ولدها من سيدها بمنزلة سيدها لأن مال الإنسان صائر إلى ولده، وقيل معناه الإماء يلدن الملوك فتكون أمة من جملة رعيته، ويحتمل أن يكون المعنى: أن الشخص يستولد الجارية ولداً ويبيعها فيكبر الولد ويشتري أمه، وهذا من أشراط الساعة. \nقوله ﷺ: « وأن ترى الحفاة العراة العالة، رعاء الشاء يتطاولون في البنيان » إذ العالة هم الفقراء، والعائل الفقير، والعيلة الفقر وعال الرجل يعيل عيلة أي افتقر. والرعاء بكسر الراء وبالمد ويقال فيه رعاة بضم الراء وزيادة تاء بلا مد معناه أن أهل البادية وأشباهم من أهل الحاجة والفاقة يترقون في البنيان والدنيا تبسط لهم حتى يتباهوا في البنيان. \nقوله: « فلبث مليا » هو بفتح الثاء على أنه للغائب، وقيل: فلبثت بزيادة تاء المتكلم وكلاهما صحيح. وملياً بتشديد الياء معناه وقتاً طويلاً.وفي رواية أبي داود والترمذي أنه قال: بعد ثلاثة أيام. وفي « شرح التنبيه » للبغوي أنه قال: بعد ثلاثة فأكثر، وظاهر هذا أنه بعد ثلاث ليال. وفي ظاهر هذا مخالفة لقول أبي هريرة في حديثه، ثم أدبر الرجل فقال رسول الله ﷺ: « ردوا علىَّ الرجل » فأخذوا يردونه فلم يروا شيئاً فقال ﷺ: « رودا علىَّ الرجل » فأخذوا يرودنه فلم يروا شيئاً فقال ﷺ: « هذا جبريل » فيمكن الجمع بينهما بأن عمر رضي الله عنه لم يحضر قول النبي ﷺ لهم في الحال، بل كان قد قام من المجلس فأخبر النبي ﷺ الحاضرين في الحال، وأخبروا عمر بعد ثلاث إذ لم يكن حاضراً عن إخبار الباقين. \nوفي قوله ﷺ: « هذا جبريل آتاكم يعلمكم أمر دينكم »، فيه دليل على ان الإيمان، والإسلام، والإحسان، تسمى كلها ديناً، وفي الحديث دليل على أن الإيمان بالقدر واجب، وعلى ترك الخوض في الأمور، وعلى وجوب الرضا بالقضاء. دخل رجل على ابن حنبل رحمه الله. فقال: عظني. فقال له: إن كان الله تعالى قد تكفل بالرزق فاهتمامك لماذا؟ وإن كان الخلف على الله حقاً فالبخل لماذا؟ وإن كانت الجنة حقاً فالراحة لماذا؟ وإن كان سؤال منكر ونكير حقاً فالأنس لماذا؟وإن كانت الدنيا فانية فالطمأنينة لماذا؟ وإن كان الحساب حقاً فالجمع لماذا؟ وإن كان كل شيء بقضاء وقدر فالخوف لماذا؟ \n(فائدة ) ذكر صاحب « مقامات العلماء » أن الدنيا كلها مقسومة على خمسة وعشرين قسماً: خمسة بالقضاء والقدر، وخمسة بالاجتهاد، وخمسة منها بالعادة، وخمسة بالجوهر، وخمسة بالوراثة. فأما الخمسة التي بالقضاء والقدر: فالرزق، والولد، والأهل، والسلطان، والعمر. والخمسة التي بالاجتهاد: فالجنة، والنار ن والعفة، والفروسية، والكتابة. والخمسة التي بالعادة: فالأكل، والنوم، والمشي، والنكاح، والتغوط.و الخمسة التي بالجوهر: فالزهد، والزكاة، والبذل، والجمال، والهيبة. والخمسة التي بالوراثة: فالخير، والتواصل، والسخاء والصدق، والأمانة. وهذا كله لا ينافي قوله ﷺ « كل شيء بقضاء وقدر ». وإنما معناه: أن بعض هذه الأشياء يكون مرتباً على سبب، وبعضها يكون بغير سبب، والجميع بقضاء وقدر.",
    "hadith": "الحديث الثاني\n\nعن عمر (رضي الله عنه) أيضاً قال: بينما نحن جلوس عند رسول الله ﷺ ذات يوم إذ طلع علينا رجل شديد بياض الثياب، شديد سواد الشعر، لا يرى عليه أثر السفر، ولا يعرفه منا أحد، حتى جلس إلى النبي ﷺ، فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، وقال: يا محمّد أخبرني عن الإسلام؟! فقال رسول الله ﷺ: \"الإسلام أن تشهد أن لا إله إلا الله، وأن محمداً رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلاً\"، قال: صدقت. فعجبنا له يسأله ويصدّقه، قال: فأخبرني عن الإيمان؟ قال: \"أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره\"، قال: صدقت. قال: فأخبرني عن الإحسان؟ قال: \"أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك\". قال: فأخبرني عن الساعة؟ قال: \"ما المسؤول عنها بأعلم من السائل\"، قال: فأخبرني عن أماراتها؟ قال: \"أن تلد الأمة ربتها، وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان\"، ثم انطلق. فلبثت ملياً، ثم قال: \"يا عمر أ تدري من السائل؟\" قلت: الله ورسوله أعلم، قال: \"فإنه جبريل أتاكم يعلّمكم دينكم\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « بني الإسلام على خمس » أي فمن أتى بهذه الخمس فقد تم إسلامه، كما أن البيت يتم بأركانه كذلك الإسلام يتم بأركانه وهي خمس، وهذا بناء معنوي شبه بالحسي، ووجه الشبه أن البناء الحسي إذا انهدم بعض أركانه لم يتم، فكذلك البناء المعنوي، ولهذا قال ﷺ: « الصلاة عماد الدين فمن تركها فقد هدم الدين »، وكذلك يقاس البقية. \nوقد ضرب الله مثلاً للمؤمنين والمنافقين فقال تعالى: { أفمن أسس بُنيانَهُ على تقوى مِنَ الله ورضوان خيُر أم من أسس بنيانه علىشفا جُرُف هارٍ فانهارَ به في نار جهنم والله لا يهدي القوم الظالمين } [التوبة109]. شبه بناء المؤمن بالذي وضع بنيانه على وسط طود أي: جبل راسخ، وشبه بناء الكافر بمن وضع بنيانه على طرف جرف بحر هار، لا ثبات له فأكله البحر فانهار الجرف فانهار بنيانه فوقع به في البحر، فغرق، فدخل جهنم. \nقوله ﷺ: « بني الإسلام على خمس » أي بخمس على أن تكون على: بمعنى الباء وإلا فالمبني غير المبنى عليه فلو أخذنا بظاهره لكانت الخمسة خارجة عن الإسلام وهو فاسد، ويحتمل أن تكون بمعنى من كقوله تعالى { إلا على أزواجهم }. [المومنون: 6والمعارج: 30]. أي من أزواجهم. الخمسة المذكورة في الحديث أصول البناء وأما التتمات المكملات كبقية الواجبات وسائر المستحبات فهي زينة للبناء. وقد ورد في الحديث أنه ﷺ قال: « الإيمان بضع وسبعون شعبة أعلاها قول لا إله إلا الله، قال وأدناها إماطة الأذى عن الطريق ». \nقوله ﷺ: « وحج البيت وصوم رمضان ». هكذا جاء في هذه الرواية بتقديم الحج على الصوم، وهذا من باب الترتيب في الذكر دون الحكم، لأن صوم رمضان وجب قبل الحج وقد جاء في الرواية الأخرى تقديم الصوم على الحج.",
    "hadith": "الحديث الثالث\n\nعن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعت رسول الله ﷺ يقول: \"بني الإسلام على خمسٍ؛ شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله: وهو الصادق المصدوق، أي شهد الله له بأنه الصادق، والمصدوق بمعنى المصدق فيه. \nقوله ﷺ « يجمع خلقه في بطن أمه » يحتمل أن يراد أن يجمع بين ماء الرجل والمرأة فيخلق منهما الولد كما قال الله تعالى: { خلق من ماء دافق * يَخْرُج من بين الصلب والترائب } [الطارق: 6، 7]. \nويحتمل أن المراد أنه يجمع من البدن كله، وذلك أنه قيل: إن النطفة في الطور الأول تسري في جسد المرأة أربعين يوماً، وهي أيام التوحمة، ثم بعد ذلك يجمع ويدر عليها من تربة المولود فتصير علقة ثم يستمر في الطور الثاني فيأخذ في الكبر حتى تصير مضغة، وسميت مضغة لأنها بقدر اللقمة التي تمضغ، ثم في الطور الثالث يصور الله تلك المضغ ويشق فيها السمع والبصر والشم والفم، ويصور في داخل جوفها الحوايا والأمعاء، قال الله تعالى: { هو الذي يصوَّرُكُم في الأرحام كيف يشاء لا إله إلا هو العزيزُ الحكيمُ } [آل عمران: 6]، ثم إذا تم الطور الثالث وهو أربعون صار للمولود أربعة أشهر نفخت فيه الروح، قال الله تعالى: {يا أيها الناس إن كنتم في ريب من البعث فإنا خلقناكم من تراب} يعني أباكم آدم { ثم من نطفة } يعني ذريته، والنطفة المني وأصلها الماء القليل وجمعها نطاف { ثم من علقة } وهو الدم الغليظ المتجمد، وتلك النطفة تصير دماً غليظاً {ثم من مضغةٍ} وهي لحمة { مُخَلَّقَةٍ وغير مُخَلَّقَة ٍ} [الحج: 5]. قال ابن عباس مخلقة: أي تامة، وغير مخلقة أي غير تامة بل ناقصة الخلق، وقال مجاهد: مصورة وغير مصورة، يعني السقط. وعن ابن مسعود رضي الله تعالى عنه: « إن النطفة إذا استقرت في الرحم أخذها الملك بكفه فقال: أي رب مخلقة، أو غير مخلقة؟ فإن قال: غير مخلقة، قذفها في الرحم دماً ولم تكن نسمة، وإن قال: مخلقة، قال الملك: أي رب ذكرُ أم أنثى؟ أشقي أم سعيدُ؟، ما الرزق وما الأجل وبأي أرض تموت؟ فيقال له اذهب إلى أم الكتاب فإنك تجد فيها كل ذلك. فيذهب فيجدها في أم الكتاب فينسخها فلا تزال معه حتى يأتي إلى آخر صفته ». \nولهذا قيل: السعادة قبل الولادة. \nقوله ﷺ: « فيسبق عليه الكتاب » أي الذي سبق في العلم، أو الذي سبق في اللوح المحفوظ، أو الذي سبق في بطن الأم. وقد تقدم أن المقادير أربعة. \nقوله ﷺ: « حتى ما يكون بينه وبينها إلا ذراع » هو تمثيل وتقريب، والمراد قطعة من الزمان من آخر عمره وليس المراد حقيقة الذراع وتحديده من الزمان، فإن الكافر إذا قال: لا إله إلا الله محمد رسول الله ثم مات دخل الجنة، والمسلم إذا تكلم في آخر عمره بكلمة الكفر دخل النار. \nوفي الحديث دليل على عدم القطع بدخول الجنة أو النار، وإن عمل سائر أنواع البر، أو عمل سائر أنواع الفسق، وعلى أن الشخص لا يتكل على عمله ولا يعجب به لأنه لا يدري ما الخاتمة. وينبغي لكل أحد أن يسأل الله سبحانه وتعالى حسن الخاتمة ويسعيذ بالله تعالى من سوء الخاتمة وشر العاقبة. فإن قيل: قال الله تعالى: { إن الذين آمنوا وعملوا الصالحات إنا لا نُضَيِّع أجر مَن أحسن عملاً }. [الكهف: 30] ظاهر الآية أن العمل الصالح من المخلص يقبل، وإذا حصل القبول بوعد الكريم أمن مع ذلك من سوء الخاتمة. \nفالجواب من وجهين: احدهما أن يكون ذلك معلقاً على شرط القبول وحسن الخاتمة، ويحتمل أن من آمن وأخلص العمل لا يختم له دائماً إلا بخير، وأن خاتمة السوء إنما تكون في حق من أساء العمل أو خلطه بالعمل الصالح المشوب بنوع من الرياء والسمعة ويدل عليه الحديث الآخر « إن أحدكم ليعمل بعمل أهل الجنة فيما يبدو للناس » أي: فيما يظهر لهم صلاح مع فساد سريرته وخبثها، والله أعلم. \nوفي الحديث دليل على استحباب الحلق لتأكيد الأمر في النفوس وقد أقسم الله تعالى: { فورب السماء والأرض إنه لحق }.[الذاريات: 23]، وقال الله تعالى: {قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم }. [التغابن: 7]. \nوالله تعالى أعلم.",
    "hadith": "الحديث الرابع\n\nعن أبي عبد الرحمن عبد الله بن مسعود (رضي الله عنه) قال: حدّثنا رسول الله ﷺ وهو الصادق المصدوق: \"إن أحدكم يجمع خلقه في بطن أمه أربعين يوماً نطفةً ثم يكون علقةً مثل ذلك ثم يكون مضغةً مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح ويؤمر بأربع كلمات: بكَتْب رزقه وأجله وعمله وشقي أو سعيد، فوالله الذي لا إله غيره إن أحد كم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع، فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها، وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « من أحدث في أمرنا هذا ما ليس منه فهو رد » أي مردود. فيه دليل على أن العبادات من الغسل والوضوء والصوم والصلاة إذا فعلت على خلاف الشرع تكون مردودة على فاعلها، وأن المأخوذ بالعقد الفاسد يجب رده على صاحبه ولا يملك، وقال ﷺ للذي قال له: إن ابني كان عسيفاً على هذا فزنى بامرأته، وإني أخبرت أن على ابني الرجم فافتديت منه بمائة شاه ووليدة، فقال ﷺ: « الوليدة والغنم ردّ عليك ». وفيه دليل على أن من ابتدع في الدين بدعة لا توافق الشرع فإثمها عليه، وعمله مردود عليه وإنه يستحق الوعيد، وقد قال صلى عليه وسلم: « من أحدث حدثاً أو آوى محدثاً فعليه لعنة الله ».",
    "hadith": "الحديث الخامس\n\nعن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت: قال رسول الله ﷺ: \"من أحدث في أمرنا هذا ما ليس منه فهو رد\". (رواه البخاري ومسلم) وفي رواية لمسلم: \"من عمل عملاً ليس عليه أمرنا فهو رد\"."
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « الحلال بين والحرام بين وبينهما أمور مشتبهات.... الخ » اختلف العلماء في حد الحلال والحرام، فقال أبو حنيفة رحمه الله تعالى: الحلال مادل الدليل على حله. وقال الشافعي رحمه الله: الحرام ما دل الدليل على تحريمه. \nقوله ﷺ: « وبينهما أمور مشتبهات » أي بين الحلال والحرام أمور مشتبهة بالحلال والحرام، فحيث انتفت الكراهة وكان السؤال عنه بدعة.وذلك إذا قدم غريب بمتاع يبيعه فلا يجب البحث عن ذلك، بل ولا يستحب، ويكره السؤال عنه. \nقوله ﷺ: «فمن اتقى الشبهات فقد استبرأ لدينه وعرضه » أي طلب براءة دينه وسلم من الشبهة. وأما براءة العرض فإنه إذا لم يتركها تطاول إليه السفهاء بالغيبة ونسبوه إلى أكل الحرام فيكون مدعاة لوقوعهم في الإثم وقد ورد عنه ﷺ أنه قال: « من كان يؤمن بالله واليوم الآخر فلا يقف مواقف التهم ».. وعن علي رضي الله عنه أنه قال: إياك وما يسبق إلى القلوب إنكاره، وإن كان عندك اعتذاره، فرب سامع نكراً لا تستطيع أن تسمعه عذرا‌ً. \nوفي صحيح الترمذي أنه عليه الصلاة والسلام قال: «إذا أحدث أحدكم في الصلاة فليأخذ بأنفه ثم لينصرف » وذلك لئلا يقال عنه أحدث. \nقوله عليه الصلاة والسلام: « فمن وقع في الشبهات وقع في الحرام » يحتمل أمرين: احدهما أن يقع في الحرام وهو يظن أنه ليس بحرام. والثاني: أن يكون المعنى قد قارب أن يقع في الحرام كما يقال: المعاصي بريد الكفر.لأن النفس إذا وقعت في المخالفة تدرجت من مفسدة إلى أخرى أكبر منها، قيل: وإلى ذلك الإشارة بقوله تعالى: { ويقتلون الأنبياء بغير حق ذلك بما عصوا وكانوا يعتدون }. [آل عمران: 112]. يريد أنهم تدرجوا بالمعاصي إلى قتل الأنبياء. \nوفي الحديث: « لعن الله السارق يسرق البيضة فتقطع يده ويسرق الحبل فتقطع يده ». أي يتدرج من البيضة والحبل إلى نصاب السرقة، والحمى ما يحميه الغير من الحشيش في الأرض المباحة فمن رعى حول الحمى يقرب أن تقع فيه ماشيته فيرعي فيما حماه الغير بخلاف ما إذا رعى إبله بعيداً من الحمى.واعلم أن كل محرم له حمى يحيط به، فالفرج محرم وحماه الفخذان لأنهما جعلاً حريماً للمحرم، وكذلك الخلوة بالإجنبية حمى للمحرم، فيجب على الشخص أن يجتنب الحريم والمحرَّم، فالمحرم حرام لعينه، والحريم محرم لأنه يتدرج به إلى المحرم. \nقوله ﷺ: « ألا وإن في الجسد مضغة » أي في الجسد مضغة إذا خشعت خشعت الجوارح، وإذا طمحت طمحت الجوارح وإذا فسدت فسدت الجوارح. قال العلماء: البدن مملكة والنفس مدينتها، والقلب وسط المملكة، والأعضاء كالخدام والقوى الباطنية كضياع المدينة، والعقل كالوزير المشفق الناصح به، والشهوة طالب أرزاق الخدام، والغضب صاحب الشرطة، وهو عبد مكار خبيث، يتمثل بصورة الناصح ونصحه سم قاتل، ودأبه أبداً منازعة الوزير الناصح والقوة المخيلة في مقدم الدماغ كالخازن، والقوة المفكرة في وسط الدماغ، والقوة الحافظة في آخر الدماغ، واللسان كالترجمان، والحواس الخمس جواسيس، وقد وكل كل واحد منهم بصنيع من الصناعات، فوكل العين بعالم الألوان، والسمع بعالم الأصوات، وكذلك سائرها فإنها أصحاب الأخبار، ثم قيل: هي كالحجبة توصل إلى النفس ما تدركه، وقيل: إن السمع والبصر والشم كالطاقات تنظر منها النفس، فالقلب هو الملك فإذا صلح الراعي صلحت الرعية وإذا فسد فسدت الرعية، وإنما يحصل صلاحه بسلامته من الأمراض الباطنة كالغل والحقد والحسد والشح والبخل والكبر والسخرية والرياء والسمعة والمكر والحرص والطمع وعدم الرضى بالمقدور، وأمراض القلب كثيرة تبلغ نحو الأربعين، عافانا الله منها وجعلنا ممن يأتيه بقلب سليم.",
    "hadith": "الحديث السادس\n\nعن أبي عبد الله النعمان بن بشير رضي الله عنهما قال: سمعت رسول الله ﷺ يقول: \"إن الحلال بيّن، وإن الحرام بيّن، وبينهما أمور مشتبهات لا يعلمهنّ كثير من الناس، فمن اتقى الشبهات، فقد استبرأ لدينه وعرضه، ومن وقع في الشبهات وقع في الحرام، كالراعي يرعى حول الحمى يوشك أن يرتع فيه، ألا وإن لكل ملك حمى، ألا وإن حمى الله محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله ألا وهي القلب\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « الدين النصيحة لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم » قال الخطابي: النصيحة كلمة جامعة معناها حيازة الحظ للمنصوح له. وقيل النصيحة مأخوذة من نصح الرجل ثوبه إذا خاطه، فشبهوا فعل الناصح فيما يتحراه من صلاح الرجل ثوبه إذا خاطه، فشبهوا فعل الناصح فيما يتحراه من صلاح المنصوح له بما يسد من خلل الثوب، وقيل: إنها مأخوذة من نصحت العسل، إذا صفيته من الشمع، شبهوا تخليص القول من الغش بتخليص العسل من الخلط. \nقال العلماء: أما النصيحة لله تعالى فمعناها ينصرف إلى الإيمان بالله، ونفي الشريك عنه، وترك الإلحاد في صفاته ووصفه بصفات الكمال والجلال كلها، وتنزيهه سبحانه وتعالى عن جميع أنواع النقائص، والقيام بطاعته، واجتناب معصيته، والحب فيه، والبغض فيه، ومودة من أطاعه، ومعاداة من عصاه، وجهاد من كفر به، والاعتراف بنعمته، وشكره عليها، والإخلاص في جميع الأمور، والدعاء إلى جميع الأوصاف المذكورة والحث عليها، والتطلف بجميع الناس، أو من أمكن منهم عليها، وحقيقة هذه الأوصاف راجعة إلى العبد في نصحه نفسه، والله تعالى غني عن نصح الناصحين. \nوأما النصيحة لكتاب الله تعالى: فالإيمان بأنه كلام الله تعالى وتنزيله، لا يشبهه شيء من كلام الناس، ولا يقدر على مثله أحد من الخلق ثم تعظيمه وتلاوته حق تلاوته، وتحسينها، والخشوع عندها، وإقامة حروفه في التلاوة، والذب عنه لتأويل المحرفين، وتعريض الطاعنين والتصديق بما فيه، والوقوف مع أحكامه، وتفهم علومه وأمثاله، والاعتبار بمواعظه، والتكفير في عجائبه، والعمل بمحكمه، والتسليم لمتشابهه، والبحث عن عمومه وخصوصه، وناسخه ومنسوخه، ونشر علومه والدعاء إليه وإلى ما ذكرناه من نصيحته. \nوأما النصيحة لرسوله ﷺ: فتصديقه على الرسالة، والإيمان بجميع ما جاء به، وطاعته في أمره ونهيه ونصرته حياً وميتاً، ومعاداة من عاداه وموالاة من ولاه، وإعظام حقه وتوقيره، وإحياء طريقته وسننه، وبث دعوته ونشر سنته، ونفس التهم عنها، ونشر علومها، والفقه فيها، والدعاء لها، والتلطف في تعلمها وتعليمها، وإعظامها وإجلالها، والتأدب عند قراءتها، والإمساك عن الكلام فيها بغير علم، وإجلال أهلها لانتسابهم إليها. والتخلق بأخلاقه والتأدب بآدابه، ومحبة أهل بيته وأصحابه، ومجانبة من ابتدع سنته أو تعرض لأحد من أصحابه ونحو ذلك.  \nوأما النصيحة لأئمة المسلمين: فمعاونتهم على الحق، وطاعتهم فيه، وأمرهم به ونهيهم وتذكيرهم برفق، وإعلامهم بما غفلوا عنه ولم يبلغهم من حقوق المسلمين وترك الخورج عليهم، وتأليف قلوب المسلمين لطاعتهم. \nقال الخطابي: ومن النصيحة لهم، الصلاة خلفهم، والجهاد معهم، وأداء الصدقات إليهم، وترك الخروج بالسيف عليهم إذا ظهر منهم حيف أو سوء عشرة، وأن لا يغروا بالثناء الكاذب عليهم، وأن يدعى لهم بالصلاح. \nقال ابن بطال رحمه الله تعالى: في هذا الحديث دليل أن النصيحة تسمى ديناً وإسلاماً، وأن الدين يقع على العمل كما يقع على القول، قال: والنصيحة فرض يجزى فيه من قام به، يسقط عن الباقين، قال: والنصيحة واجبة على قدر الطاعة إذا علم الناصح أنه يقبل نصحه ويطاع أمره وأمن على نفسه المكروه، فإن خشي أذى فهو في سعة والله تعالى أعلم. فإن قيل ففي صحيح البخاري أنه ﷺ قال: « إذا استنصح أحدكم أخاه فلينصح له »، وهويدل على تعليق الوجوب بالاستنصاح لا مطلقاً، ومفهوم الشرط حجة في تخصيص عموم المنطوق. فجوابه: يمكن حمل ذلك على الأمور الدنيونية كنكاح امرأة ومعاملة رجل ونحو ذلك، والأول يحتمل بعمومه في الأمور الدينية التي هي واجبة على كل مسلم، والله تعالى أعلم.",
    "hadith": "الحديث السابع\n\nعـن أبي رقية تميم بن أوس الداري (رضي الله عنه) أن النبي ﷺ قال: \"الدين النصيحة\"، قلنا لمن؟ قال: \"لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « أمرت إلخ.. » فيه دليل على أن مطلق الأمر وصيغته تدل على الوجوب. \nقوله ﷺ: «فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم »، فإن قيل: فالصوم من أركان الإسلام وكذلك الحج ولم يذكرهما، فجوابه: أن الصوم لا يقاتل الإنسان عليه بل يحبس ويمنع الطعام والشراب، والحج على التراخي، فلايقاتل عليه، وإنما ذكر رسول الله صلى عليه وسلم هذه الثلاثة لأنه يقاتل على تركها ولهذا لم يذكر الصوم والحج لمعاذ حين بعثه إلى اليمن، بل ذكر هذه الثلاثة، خاصة.. \nوقوله ﷺ: «إلا بحق الإسلام » فمن حق الإسلام فعل الواجبات، فمن ترك الواجبات جاز قتاله كالبغاة، وقطاع الطريق، والصائل، ومانع الزكاة، والممتنع من بذله الماء للمضطر والبهيمة المحترمة. والجاني والممتنع من قضاء الدين مع القُدرة، والزاني المحصن، وتارك الجمعة والوضوء. \nففي تلك الأحوال يباح قتله وقتاله، وكذلك لو ترك الجماعة، وقلنا إنها فرض عين، أو كفاية. \nقوله ﷺ: « وحسابهم على الله » يعني من أتى بالشهادتين واقام الصلاة وآتى الزكاة عصم دمه وماله، ثم إن كان فعل ذلك بنية خالصة صالحة فهو مؤمن، وإن كان فعله تقية وخوفاً من السيف كالمنافق فحسابه على الله، وهو متولي السرائر، وكذلك من صلى بغير وضوء أو غسل من الجنابة، أو أكل في بيته وادعى أنه صائم، يقبل منه وحسابه على الله عز وجل والله أعلم.",
    "hadith": "الحديث الثامن\n\nعن ابن عمر رضي الله عنهما أن رسول الله ﷺ قال: \"أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمداً رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله تعالى\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ « ما نهيتكم عنه فاجتنبوه » أي اجتنبوه جملة واحدة لا تفعلوه ولا شيئاً منه، وهذا محموله على نهي التحريم، فأما نهي الكراهة فيجوز فعله، وأصل النهي في اللغة: المنع. \nقوله ﷺ: « وما أمرتكم به فأتوا منه ما استطعتم » فيه مسائل: منها إذا وجد ماء للوضوء لا يكفيه فالأظهر وجوب استعماله ثم يتيمم للباقي. ومنها إذا وجد بعض الصاع في الفطرة فإنه يجب إخراجه. ومنها إذا وجد بعض ما يكفي لنفقة القريب أو الزوجة أو البهيمة فإنه يجب بذله. وهذا بخلاف ما اذا وجد بعض الرقبة فإنه لا يجب عتقه عن الكفارة، لأن الكفارة لها بدل وهو الصوم. \nوقوله ﷺ: « فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم علىأنبيائهم ». اعلم ان السؤال على أقسام: \nالقسم الأول: سؤال الجاهل عن فرائض الدين كالوضوء والصلاة والصوم، وعن أحكام المعاملة ونحو ذلك. \nوهذا السؤال واجب وعليه حمل قوله ﷺ: « طلب العلم فريضة على كل مسلم » ومسلمة، ولا يسع الإنسان السكوت عن ذلك قال تعالى: { فاسألوا أهل الذكر إن كنتم لا تعلمون } [النحل: 43]، وقال ابن عباس رضي الله عنهما: إني أعطيت لساناً سؤولاً وقلباً عقولاً، كذلك أخبر عن نفسه رضي الله تعالى عنه. \nوالقسم الثاني: السؤال عن التفقه في الدين سبحانه وتعالى: { فلولا نفر َ مِنْ كُلَّ فرقةٍ منهم طائفة، ليتفقهوا في الدين ولِينذِروا قومَهُمْ إذا رَجَعوا إليهم لعلهم يَحذَرون } [التوبة: 122]. \nوقال ﷺ: « ألا فليعلم الشاهد منكم الغائب ». \nالقسم الثالث: أن يسأل عن شيء لم يوجبه الله عليه، ولا على غيره، وعلى هذا حمل الحديث لأنه قد يكون في السؤال ترتب مشقة بسبب تكليف يحصل ولهذا قال ﷺ: « وسكت عن أشياء رحمة لكم فلا تسألوا عنها ». وعن علي رضي الله عنه لما نزلت {ولله على الناس حج البيت من استطاع إليه سبيلا ً}. [آل عمران: 97]. \nقال رجل: أكل عام يا رسول الله؟ فأعرض عنه، حتى أعاد مرتين أو ثلاثاً فقال رسول الله ﷺ: « وما يوشك أن أقول نعم، والله لو قلت: نعم لوجبت، ولو وجبت لما استطعتم، فاتركوني ما تركتكم فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم فإذا أمرتكم بأمر فأتوا منه ما استطعتم وإذا نهيتكم عن أمر فاجتنبوه ». \nفأنزل الله تعالى: { يا أيها الذين آمنوا لا تسألوا عن أشياء إن تُبْدَ لكم تَسُؤُكُم } [المائدة: 101]. أي لم آمركم بالعمل بها، وهذا النهي خاص بزمانه ﷺ. أما بعد أن استقرت الشريعة، وأمن من الزيادة فيها زال النهي بزوال سببه، وكره جماعة من السلف السؤال عن معاني الآيات المشتبهة. \nسئل مالك رحمه الله تعالى عن قوله تعالى: {الرحمن على العرش استوى }[طه: 5] فقال: الاستواء معلوم، والكيف مجهول، والإيمان به واجب، والسؤال عنه بدعة وأراك رجل سوء أخرجوه عني. \nوقال بعضهم: مذهب السلف أسلم، ومذهب الخلف أعلم: وهو السؤال.",
    "hadith": "الحديث التاسع\n\nعن أبي هريرة عبد الرحمن بن صخر رضي الله عنه قال: سمعت رسول الله ﷺ يقول: \"ما نهيتكم عنه فاجتنبوه، وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « إن الله تعالى طيب »، عن عائشة رضي الله عنها قالت: سمعت رسول الله صلى عليه وسلم يقول: « اللهم إني أسألك باسمك المطهر الطاهر، الطيب المبارك الأحب إليك الذي إذا دعيت به أجبت، وإذا سئلت به أعطيت، وإذا استرحمت به رحمت، واذا استفرجت به فرجت »، ومعنى الطيب: المنزه عن النقائص والخبائث، فيكون بمعنى القدوس وقيل طيب الثناء ومسلتذ الأسماء عند العارفين بها: وهو طيب عباده لدخول الجنة بالإعمال الصالحة وطيبها لهم، والكلمة الطيبة: لا إله إلا الله. \nقوله ﷺ: « لا يقبل إلا طيباً » أي فلا يتقرب إليه بصدقة حرام، ويكره التصدق بالرديء من الطعام كالحب العتيق المسوس، وكذلك يكره التصدق بما فيه شبهة قال الله تعالى: { ولا تيمموا الخبيث منه تنفقون } [البقرة: 267]. فكما أنه تعالى لا يقبل المال إلا الطيب كذلك لا يقبل من العمل إلا الطيب الخالص من شائبة الرياء والعجب والسمعة ونحوها. \nقوله: فقال تعالى: { يا أيها الرسل كلوا من الطيبات واعملوا صالحاً } [المؤمنون: 51].وقوله تعالى: { يا أيها الذين أمنوا كلوا من طيبات ما رزقناكم }[البقرة: 172]. المراد بالطيبات الحلال. \nفي الحديث دليل على أن الشخص يثاب على ما يأكله إذا قصد به التقوي على الطاعة أو إحياء نفسه، وذلك من الواجبات، بخلاف ما إذا أكل لمجرد الشهوة والتنعم. \nقوله: « مطعمه حرام ومشربه حرام وغذي بالحرام » أي شبع، وهو بضم الغين المعجمة وكسر الذال المعجمة المخففة من الغذي بالكسر والقصر، وأما الغداء بالفتح والمد والدال المهملة: فهو عبارة عن نفس الطعام الذي يؤكل في الغداة، قال الله تعالى: { قال لفتاه آتنا غداءنا } [الكهف: 62]. \nقوله: «فأنى يستجاب له » أي استبعاداُ لقبوله إجابة الدعاء، ولهذا شرط العبادي لقبول الدعاء أكل الحلال، والصحيح أن ذلك ليس بشرط فقد استجاب لشر خلقه إبليس فقال: {إنك من المنظرين } [الأعراف: 15].",
    "hadith": "الحديث العاشر\n\nعن أبي هريرة (رضي الله عنه) قال: قال رسول الله ﷺ: \"إن الله تعـالى طيب لا يقبل إلا طيباً، وإن الله أمر المؤمنين بما أمر به المرسلين فقال تعالى: (يا أيها الرسل كلوا من الطيبات واعملوا صالحاً)، وقال تعالى: (يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم) ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء: يا ربِّ يا ربِّ، ومطعمه حرام، ومشربه حرام، وملبسه حرام، وغذي بالحرام، فأنى يستجاب له؟\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ «دع ما يريبك إلى ما لا يريبك » فيه دليل على أن المتقي ينبغي له أن لا يأكل المال الذي فيه شبهة، كما يحرم عليه أكل الحرام، وقد تقدم. \nقوله: « إلى ما لا يريبك » أي اعدل إلى ما لا ريب فيه من الطعام الذي يطمئن به القلب وتسكن إليه النفس. والريبة: الشك وتقدم الكلام عن الشبهة.",
    "hadith": "الحديث الحادي عشر\n\nعن أبي محمد الحسن بن علي بن أبي طالب سبط رسول الله ﷺ وريحانته رضي الله عنهما قال: حفظت من رسول الله ﷺ: \"دع ما يريبك إلى ما لا يريبك\". (رواه الترمذي والنسائي، وقال الترمذي: حديث حسن صحيح)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « من حسن إسلام المرء تركه ما لا يعنيه » أي ما لا يهمه من أمر الدين والدنيا من الأفعال والأقوال. وقال ﷺ لأبي ذر حين سأله عن صحف إبراهيم قال: « كانت أمثالاً كلها، كان فيها: أيها السلطان المغرور إني لم أبعثك لتجمع الأموال بعضها على بعض ولكن بعثتك لترد عن دعوة المظلوم فإني لا أردها، ولوكانت من كافر. وكان فيها: على العاقل ما لم يكن مغلوباً على عقله أن يكون له أربع ساعات: ساعة يناجي فيها ربه، وساعة يتفكر في صنع الله تعالى، وساعة يحدث فيها نفسه، وساعة يخلو بذي الجلال والإكرام، وإن تلك الساعة عون له علىتلك الساعات، .و كان فيها: على العاقل ما لم يكن مغلوباً على عقله، أن لا يكون ساعياً إلا في ثلاث: تزود لمعاد، ومؤنة لمعاش، ولذة في غير محرم.وكان فيها: على العاقل ما لم يكن مغلوباً على عقله أن يكون بصيراً لزمانه، مقبلاً على شأنه. حافظاً للسانه، ومن حسب الكلام من عمله يوشك أن يقل الكلام إلا فيما يعنيه ». \nقلت: بأبي وأمي فما كان في صحف موسى؟ قال: « كانت عبراً كلها، كان فيها: عجباً لمن أيقن بالنار كيف يضحك، وعجباً لمن أيقن بالموت كيف يفرح، وعجباً لمن رآى الدنيا وتقلبها بأهلها وهو يطمئن إليها، وعجباً لمن أيقن بالقدر ثم هو يغضب، وعجباً لمن أيقن بالحساب غداً وهو لا يعمل »؟!. \nقلت: بأبي وأمي هل بقي مما كان في صحفهما شيء؟ قال: «نعم يا أباذر { قد أفلح من تزكى * وذكر اسم ربه فصلى* بل تؤثرون الحياة الدنيا * والآخِرُة خيرَّ وأبقى * إنَّ هذا لفي الصُّحُفِ الأولى * صحف إبراهيم وموسى } [الأعلى: 14-19]. إلى آخر السورة. \nقلت: بأبي وأمي أوصني، قال: « أوصيك بتقوى الله فإنها رأس أمرك كله »، قال: قلت زدني، قال: « عليك بتلاوة القرآن واذكر الله كثيراً فإنه يذكرك في السماء »، قلت زدني، قال: « عليك بالجهاد فإنه رهبانية المؤمنين »، قلت زدني، قال: « عليك بالصمت فإنه مطردة للشياطين عنك، وعون لك على أمر دينك »، قلت زدني، قال: « قل الحق ولو كان مراً »، قلت زدني، قال: « لا تأخذك في الله لومة لائم »، قلت: زدني، قال«صل رحمك وإن قطعوك »، قلت: زدني، قال: «بحسب امرئ من الشر ما يجهل من نفسه، ويتكلف ما لا يعنيه. يا أبا ذر: لا عقل كالتدبير، ولا ورع كالكف، ولا حسن كحسن الخلق ».",
    "hadith": "الحديث الثاني عشر\n\nعن أبي هريرة رضي الله تعالى عنه قال: قال رسول الله ﷺ: \"من حسن إسلام المرء تركه مالا يعنيه\". (حديث حسن رواه الترمذي وغيره هكذا)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ « لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه »: الأولى أن يحمل ذلك علىعموم الأخوة، حتي يشمل الكافر والمسلم، فيحب لأخيه الكافر ما يحب لنفسه من دخوله في الإسلام، كما يحب لأخيه المسلم دوامه على الإسلام، ولهذا كان الدعاء بالهداية للكافر مستحباً، والحديث محمول على نفي الإيمان الكامل عمن لم يحب لأخيه ما يحب لنفسه. والمراد بالمحبة إرادة الخير والمنفعة، ثم المراد: المحبة الدينية لا المحبة البشرية، فإن الطباع البشرية قد تكره حصول الخير وتمييز غيرها عليها، والإنسان يجب عليه أن يخالف الطباع البشرية ويدعو لأخيه ويتمنى له ما يحب لنفسه، والشخص متى لم يحب لأخيه ما يحب لنفسه كان حسوداً. \nوالحسد كما قال الغزالي: ينقسم إلى ثلاثة أقسام: \nالأول: أن يتمنى زوال نعمة الغير وحصولها لنفسه. \nالثاني: أن يتمنى زوال نعمة الغير وإن لم تحصل له كما إذا كان عنده مثلها أو لم يكن يحبها، وهذا أشر من الأول. \nالثالث: أن لا يتمنى زوال النعمة عن الغير ولكن يكره ارتفاعه عليه في الحظ والمنزلة ويرضى بالمساواةولا يرضى بالزيادة، وهذا أيضاً محرم لأنه لم يرض بقسمة الله تعالى: { أهم يقسمون رحمة ربك؟! نحن قسمنا معيشتهم في الحياة الدنيا ورفعنا بعضَهُم فوق بعضٍ درجاتٍ ليتخذَ بعضُهًم بعضاً سخرياً ورحمةُ ربكَ خيرُُمما يجمعون } [الزخرف: 32]. فمن لم يرض بالقسمة فقد عارض الله تعالى في قسمته وحكمته.وعلى الإنسان أن يعالج نفسه ويحملها علىالرضى بالقضاء ويخالفها بالدعاء لعدوه بما يخالف النفس.",
    "hadith": "الحديث الثالث عشر\n\nعن أبي حمزة أنس بن مالك رضي الله عنه خادم رسول الله ﷺ عن النبي ﷺ قال: \"لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « الثيب الزاني » المراد: من تزوج ووطىء في نكاح صحيح ثم زنا بعد ذلك، فإنه يرجم، وإن لم يكن متزوجاً في حالة الزنا لاتصافه بالإحصان. \nقوله ﷺ: « والنفس بالنفس » أي بشرط المكافأة فلا يقتل المسلم بالكافر ولا الحر بالعبد عند الشافعية، لا الحنفية. \nقوله ﷺ: « والتارك لدينه المفارق للجماعة »وهو المرتد والعياذ بالله تعالى، وقد يكون موافقاً للجماعة كاليهودي إذا تنصر، وبالعكس يقتل لأنه تارك لدينه غير مفارق للجماعة، وفيه قولان، أصحها: لا يقتل بل يلحق بالمأمن. والثاني: يقتل لأنه اعتقد بطلان دينه الذي كان عليه وانتقل إلى دين كان يرى بطلانه قبل ذلك، وهو غير الحق فلا يترك بل إن لم يسلم يقتل، وقد تقدم القتل أيضاً في صورة سبق الكلام عليها.",
    "hadith": "الحديث الرابع عشر\n\nعن ابن مسعود رضي الله تعالى عنه قال: قال رسول الله ﷺ: \"لا يحل دم امرئ مسلم إلا بإحدى ثلاث: الثيب الزاني، والنفس بالنفس، والتارك لدينه المفارق للجماعة\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت » قال الشافعي رحمه الله تعالى: معنى الحديث: إذا أراد أن يتكلم فليفكر، فإن ظهر أنه لا ضرر عليه تكلم، وإن ظهر أن فيه ضرر أو شك فيه أمسك. وقال الإمام الجليل أبو محمد ابن أبي زيد إمام المالكية بالمغرب في زمنه: جميع آداب الخير تتفرع من أربعة أحاديث: قول النبي ﷺ « من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت ». وقوله ﷺ: « من حسن إسلام المرء تركه ما لا يعنيه ». وقوله ﷺ: للذي اختصر له الوصية: « لا تغضب ». وقوله: « لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه ». \nونقل عن أبي القاسم القشيري رحمه الله تعالى أنه قال: السكوت في وقته صفة الرجال، كما أن النطق في موضعه من أشرف الخصال. قال: وسمعت أبا علي الدقاق يقول: من سكت عن الحق فهو شيطان أخرس.وكذا نقله في « حلية العلماء » عن غير واحد. وفي « حلية الأولياء » أن الإنسان ينبغي له أن لا يخرج من كلامه إلا ما يحتاج إليه، كما أنه لا ينفق من كسبه إلا ما يحتاج إليه وقال: لو كنتم تشترون الكاغد للحفظة لسكتم عن كثير من الكلام. وروي عنه ﷺ أنه قال: « من فقه الرجل قلة كلامه فيما لا يعنيه » وروي عنه ﷺ أنه قال: « العافية في عشرة أجزاء: تسعة منها في الصمت إلاَّ عن ذكر الله تعالى عز وجل ».ويقال: من سكت فسلم، كمن قال فغنم. وقيل لبعضهم: لم لزمت السكوت؟ قال: لأن لم أندم على السكوت قط، وقد ندمت على الكلام مراراً. ومما قيل: جرح اللسان كجرح اليد، وقيل: اللسان كلب عقور إن خلي عنه عقر.وروي عن على رضي الله عنه. \nقوله ﷺ: « من كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ». \nقال القاضي عياض: معنى الحديث: أن من التزم شرائع الإسلام، لزمه إكرام الضيف والجار. وقد قال ﷺ: « ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ». وقال ﷺ « من آذى جاره ملكه الله داره ». وقوله تعالى: {والجار ذي القربي والجار الجنب }[النساء: 36]. \nالجار يقع على أربعة: الساكن معك في البيت. قال الشاعر: أجارتنا بالبيت إنك طالق \nويقع على من لاصق لبيتك، ويقع على أربعين داراً من كل جانب، ويقع على من يسكن معك في البلد، قال الله تعالى: {ثم لا يجاورنك فيها إلا قليلاً }[الأحزاب: 6] فالجار القريب المسلم له ثلاثة حقوق، والجار البعيد المسلم له حقان، وغير القريب المسلم له حق واحد. \nوالضيافة من آداب الإسلام، وخلق النبين والصالحين، وقد أوجبها الليث ليلة واحدة، واختلفوا: اهل الضيافة على الحاضر والبادي، أم على البادي خاصة؟ فذهب الشافعي، ومحمد بن عبد الحكم إلى أنها على الحاضر والبادي.وذهب مالك وسحنون: إلى أنها على أهل البوادي، لأن المسافر يجد في الحضر المنازل في الفنادق ومواضع النزول وما يشتري من الأسواق وقد جاء في حديث: « الضيافة على أهل الوبر وليست على أهل المدر ». \nلكنه حديث موضوع.",
    "hadith": "الحديث الخامس عشر\n\nعن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: \" من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ « لا تغضب » معناه لاتنفذ غضبك، وليس النهي راجعاً إلىنفس الغضب، لأنه من طباع البشر، ولا يمكن الإنسان دفعه. \nوقوله عليه الصلاة والسلام: « إياكم والغضب فإنه جمرة تتوقد في فؤاد ابن آدم، ألم تر إلى أحدكم إذا غضب كيف تحمر عيناه وتنتفخ أوداجه، فإذا أحس أحدكم بشيء من ذلك فليضجع أو ليلصق بالأرض ». \nوجاء رجل إلى النبي ﷺ فقال: يا رسول الله علمني علماً يقربني من الجنة ويبعدني من النار قال: « لا تغضب ولك الجنة ». وقال ﷺ: « إن الغضب من الشيطان وإن الشيطان خلق من النار وإنما يطفىء النار الماء فإذا غضب أحدكم فليتوضأ ». \nوقال أبو ذر الغفاري: قال لنا رسول الله ﷺ: « إذا غضب أحدكم وهو قائم فليجلس، فإن ذهب عنه الغضب وإلا فليضجع ». \nوقال عيسى عليه الصلاة والسلام ليحي بن زكريا عليه الصلاة والسلام: إني معلمك علماً نافعاً: لا تغضب. فقال: وكيف لي أن لا أغضب؟قال إذا قيل لك ما فيك فقل: ذنب ذكرته أستغفر الله منه، وإن قيل لك ما ليس فيك فاحمد الله إذ لم يجعل فيك ما عيرت به، وهي حسنة سيقت إليك. \nوقال عمرو بن العاص: سألت رسول الله ﷺ عما يبعدني عن غضب الله تعالى قال: « لا تغضب ». \nوقال لقمان لأبنه: إذا أردت أن تؤاخي أخاً فأغضبه، فإن أنصفك وهو مغضب، وإلا فاحذره.",
    "hadith": "الحديث السادس عشر\n\nعن أبي هريرة رضي الله عنه: أن رجلاً قال للنبي ﷺ: أوصني، قال: \"لا تغضب\"، فردّد مراراً، قال: \"لا تغضب\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « إن الله كتب الإحسان على كل شيء » من جملة الإحسان عند قتل المسلم في القصاص أن يتفقد آلة القصاص، ولا يقتل بآلة كالّة، وكذلك يحد الشفرة عند الذبح، ويريح البهيمة، ولا يقطع منها شيء حتى تموت، ولا يحد السكين قبالتها، وأن يعرض عليها الماء قبل الذبح، ولا يذبح اللبون، ولا ذات الولد، حتى يستغني عن اللبن.وإن لا يستقصي في الحلب، ويقلم أظفاره عند الحلب، قالوا: ولا يذبح واحدة قدّام أخرى.",
    "hadith": "الحديث السابع عشر\n\nعن أبي يعلى شداد بن أوس رضي الله عنه عن رسول الله ﷺ قال: \"إن الله كتب الإحسان على كل شيء، فإذا قتلتم فأحسنوا القتلة، وإذا ذبحتم فأحسنوا الذبحة؛ وليحدّ أحدكم شفرته وليرح ذبيحته\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « اتق الله حيثما كنت » أي اتقه في الخلوة كما تتقيه في الجلوة بحضرة الناس، واتقه في سائر الأمكنة والأزمنة. مما يعين على التقوى استحضار أن الله تعالى مطلع على العبد في سائر أحواله، قال الله تعالى: {ما يكون من نجوى ثلاثة إلا هو رابعهم ولا خمسة إلا هو سادسهم ولا أدنى من ذلك ولا أكثر إلا هو معهم أين ما كانوا ثم يُنَبِّئُهم بما عملوا يوم القيامة إنّ الله بكل شيء عليم } [المجادلة: 7]. والتقوى كلمة جامعة لفعل الواجبات وترك المنهيات. \nوقوله ﷺ: « وأتبع السيئه الحسنة تمحها » أي إذا فعلت سيئة فاستغفر الله تعالى منها وافعل بعدها حسنة تمحها. \nاعلم: أن ظاهر هذا الحديث يدل على أن الحسنة لا تمحو إلا سيئة واحدة، وإن كانت الحسنة بعشر، وأن التضعيف لا يمحو السيئه، وليس هذا على ظاهره، بل الحسنة الواحدة تمحو عشر سئيات. وقد ورد في الحديث ما يشهد لذلك وهو قوله ﷺ: «تُكِّبرون دبر كل الصلاة عشراً وتحمدون عشراً وتُسبِّحون عشراً فذلك مَائة وخمسون باللسان وألف وخمسائة في الميزان ». \nثم قال ﷺ: « أيكم يفعل في اليوم الواحد ألفاً وخمسمائة سيئة »دل على أن التضعيف يمحو السيئات. وظاهر الحديث: أن الحسنة تمحو السيئة المتعلقة بحق الله تعالى، أما السيئة المتعلقة بحق العباد من الغضب والغيبة والنميمة، فلا يمحوها إلا الاستحلال من العباد، ولا بد أن يعين له جهة الظلامة، فيقول: قلت عليك كيت وكيت. \nوفي الحديث دليل على أن محاسبة النفس واجبة، قال ﷺ: « حاسبوا أنفسكم قبل أن تحاسبوا ». وقال الله تعالى: { يا أيها الذين آمنوا اتقوا الله ولتَنظُر نفسُ ما قدمت لغد ٍ} [الحشر: 18]. \nقوله ﷺ: « وخالق الناس بخلق حسن ».. اعلم أن الخلق الحسن كلمة جامعة للإحسان إلى الناس، وإلى كف الأذى عنهم، قال ﷺ: « إنكم لن تسعوا الناس بأموالكم فسعوه ا ببسط الوجه وحسن الخلق ». \nوعنه ﷺ: « خيركم أحسنكم أخلاقاً». \nوعنه ﷺ: « أن رجلاً أتاه فقال: يا رسول الله ما أفضل الأعمال؟ قال: « حسن الخلق »، وهو على ما مر أن أن لا تغضب. \nويقال: اشتكى نبي إلى ربه سوء خلق امرأته، فأوحى الله إليه: قد جعلت ذلك حظك من الأذى. \nوعن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: « أكمل المؤمنين إيماناً أحسنهم أخلاقاً، وخيارهم خيارهم لنسائهم ». \nوعنه ﷺ: « إن الله اختار لكم الإسلام ديناً فأكرموه بحسن الخلق والسخاء، فإنه لا يكمل إلا بها ». \nوقال جبريل عليه السلام للنبي ﷺ حين نزل قوله تعالى: { خذ العفو وأمر بالعرف وأعرض عن الجاهلين } [الأعراف: 199]. \nقال في تفسير ذلك: أن تعفو عمن ظلمك، وتصل من قطعك وتعطي من حرمك. \nوقال الله تعالى: { اُدْفَعْ بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم } [فصلت: 34]. \nوقيل في تفسير قوله تعالى: { وإنَّكَ لعلى خُلُقٍ عظيم } [القلم: 4]. \nقال: كان خلقه القرآن، يأتمر بأمره وينزجر بزواجره، ويرضى لرضاه، ويسخط لسخطه ﷺ.",
    "hadith": "الحديث الثامن عشر\n\nعن أبي ذر جندب بن جنادة وأبي عبد الرحمن معاذ بن جبل رضي الله عنهما عن رسول الله ﷺ قال: \"اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن\". (رواه الترمذي وقال: حديث حسن، وفي بعض النسخ: حسن صحيح)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « احفظ الله يحفظك » أي احفظ أوامره وامتثلها، وانته عن نواهيه، يحفظك في تقلباتكم ودنياك وآخرتك قال الله تعالى: { من عمل صالحاً من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة } [النحل: 97]. وما يحصل للعبد من البلاء والمصائب بسبب تضييع أوامر الله تعالى، قال الله تعالى: {وما أصابكم من مصيبة فبما كسبت أيديكم }[الشورى: 30]. \nقوله ﷺ: « تجده تجاهك » أي أمامك، قال ﷺ: « تعرف إلى الله في الرخاء يعرفك في الشدة » وقد نص الله تعالى في كتابه: أن العمل الصالح ينفع في الشدة وينجي فاعله، وأن عمل المصائب يؤدي بصاحبه إلى الشدة، قال الله تعالى حكاية عن يونس عليه الصلاة والسلام: {فلو لا أنه كان من المسبحين للبث في بطنه إلى يوم يبعثون } [الصافات: 143-144]. ولما قال فرعون: {آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل } قال الملك: {الآن وقد عصيت قبل وكنت من المفسدين } [يونس: 90-91]. \nقوله ﷺ: « إذا سألت فاسأل الله » إشارة إلى أن العبد لا ينبغي له أن يعلق سره بغير الله، بل يتوكل عليه في سائر أموره، ثم إن كانت الحاجة التي يسألها لم تجر العادة بجريانها على أيدي خلقه: كطلب الهداية، والعلم، والفهم في القرآن والسنة، وشفاء المرض، وحصول العافية من بلاء الدنيا وعذاب الآخرة، سأل ربه ذلك. وإن كانت الحاجة التي يسألها جرت العادة أن الله سبحانه وتعالى يجريها على أيدي خلقه، كالحاجات المتعلقة بأصحاب الحرف والصنائع وولاة الأمور، سأل الله تعالى أن يعطف عليه قلوبهم فيقول: اللهم حنن علينا قلوب عبادك وإمائك، وما أشبه ذلك، ولا يدعو الله تعالى باستغنائه عن الخلق لأنه ﷺ سمع علياً يقول: اللهم اغننا عن خلقك فقال: « لا تقل هكذا فإن الخلق يحتاج بعضهم إلى بعض، ولكن قل: اللهم اغننا عن شرار خلقك » وأما سؤال الخلق والاعتماد عليهم فمذموم، ويروى عن الله تعالى في الكتب المنزلة: أيقرع بالخواطر باب غيري وبابي مفتوح؟ أم هل يؤمل للشدائد سواي وأنا الملك القادر؟ لأكسونَّ من أمل غيري ثوب المذلة بين الناس... الخ. \nقوله: « واعلم أن الأمة » الخ، لما كان قد يطمع في بر من يحبه ويخاف شر من يحذره، قطع الله اليأس من نفع الخلق بقوله: {وإن يمسسك الله بُضرٍ فلا كاشف له إلا هو وإن يردك بخير فلا راد لفضله }[يونس: 107]. ولا ينافي هذا كله قوله تعالى حكاية عن موسى عليه الصلاة والسلام: {فأخاف أن يقتلون }[الشعراء: 14]. [والقصص: 33]. وقوله تعالى: {إنّنا نخافُ أن يفرطَ علينا أو أنْ يَطْغى } [طه: 45]. وكذا قوله: { خذوا حذركم } [النساء: 71] إلى غير ذلك. \nبل السلامة بقدر الله، والعطب بقدر الله، والإنسان يفر من أسباب العطب إلى أسباب إلى أسباب السلامة، قال الله تعالى: {ولا تلقوا بأيديكم إلى التهلُكة }[البقرة: 195]. \nقوله ﷺ: «واعلم أن النصر مع الصبر » قال صلى عليه وسلم: « لا تتمنوا لقاء العدو، واسألوا الله العافية، فإذا لقيتموهم فاصبروا ولا تفروا، فإن الله مع الصابرين ».. وكذلك الصبر على الأذى في موطن يعقبه النصر. \nقوله ﷺ: « وأنّ الفرج مع الكرب » والكرب هو شدة البلاء، فإذا اشتد البلاء أعقبه الله تعالى الفرج كما قيل: اشتدي أزمة تنفرجي. \nقوله ﷺ: « وأن مع العسر يسراً » قد جاء في حديث آخر أنه ﷺ قال: « لن يغلب عسر يسرين » وذلك أن الله تعالى ذكر العسر مرتين وذكر اليسر مرتين، لكن عند العرب أن المعرفة إذا أعيدت معرفة توحدت لأن اللام الثانية للعهد، واذا أعيدت النكرة تعددت فالعسر ذكر مرتين معرفاً، واليسر مرتين منكراً فكان، اثنين فلهذا قال ﷺ: « لن يغلب عسر يسرين ».",
    "hadith": "الحديث التاسع عشر\n\nعن أبي العباس عبد الله بن عباس رضي الله عنهما قال: كنت خلف النبي ﷺ يوماً، فقال لي: \"يا غلام إني أعلّمك كلمات: احفظ الله يحفظك، احفـظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لـم ينفعـوك إلا بشيء قـد كتبـه الله لك، وإن اجتمعوا على أن يضرّوك بشيء لم يضرّوك إلا بشيء قد كتبه الله عليك، رفعت الأقلام وجفّت الصحف\". (رواه الترمذي وقال: حسن صحيح) \nوفي رواية غير الترمذي: \"احفظ الله تجده أمامك، تعرّف إلى الله في الرخاء يعرفك في الشدة، واعلم أن ما أخطأك لم يكن ليصيبك، وما أصابك لم يكن ليخطئك، واعلم أن النصر مع الصبر، وأن الفرج مع الكرب، وأن مع العسر يسراً\"."
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « اذا لم تستح فاصنع ما شئت » معناهُ: إذا أردت فعل شيء، فإن كان مما لا تستحي من فعله من الله، ولا من الناس فافعله، وإلا فلا. وعلى هذا الحديث يدور مدار الإسلام كله، وعلى هذا يكون قوله ﷺ: «فاصنع ما شئت » أمر إباحة، لأن الفعل إذا لم يكن منهياً عنه شرعاً كان مباحاً. \nومنهم من فسر الحديث بأنك إذا كنت لا تستحي من الله ولا تراقبه فاعط نفسك مناها وافعل ما تشاء، فيكون الأمر فيه للتهديد لا للإباحة، ويكون كقوله تعالى: {اعملوا ما شئتم }[فصلت: 40]. وكقوله تعالى: {واستفزز من استطعت منهم بصوتك وأجلب عليهم بخيلك ورَجلكَ وشارِكهُمْ في الأموال والأولاد وعِدْهُم وما يعدهم الشيطانُ إلا غروراً }[الإسراء: 64].",
    "hadith": "الحديث العشرون\n\nعن أبي مسعود عقبة بن عمرو الأنصاري البدري رضي الله عنه قال: قال رسول الله ﷺ: \"إن مما أدرك الناس من كلام النبوة الأولى: إذا لم تستح فاصنع ما شئت\". (رواه البخاري)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « قل آمنت بالله ثم استقم »أي كما أمرت ونهيت، والاستقامة ملازمة الطريق بفعل الواجبات وترك المنهيات، قال الله تعالى: {فاستقم كما أمرت ومن تاب معك }[هود: 112].وقال الله تعالى: {إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة }[فصلت: 30]. أي عند الموت تبشرهم بقوله تعالى: {لا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنت توعدون }[فصلت: 30]. \nوفي التفسير أنهم إذا بشروا بالجنة قالوا: وأولادنا ما يأكلون وما حالهم بعدنا؟ فيقال لهم: {نحن أولياؤكم في الحياة الدنيا وفي الآخرة }.[فصلت: 31]أي نتولى أمرهم بعدكم، فتقر بذلك أعينهم.",
    "hadith": "الحديث الحادي والعشرون\n\nعن أبي عمرو، وقيل أبي عمرة سفيان بن عبد الله رضي الله عنه قال: \"قلت: يا رسول الله قل لي في الإسلام قولاً لا أسأل عنه أحداً غيرك، قال: \"قل آمنت بالله ثم استقم\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nومعنى حرّمت الحرام: اجتنبته، ومعنى أحللت الحلال: فعلته معتقداً حلّه.\nوَمَعْنى حَرَّمْتُ الحَرامَ: اجْتَنَبْتُهُ. وَمَعْنى أَحْلَلْتُ الحَلالَ: فَعَلْتُهُ مُعْتَِقداً حِلَّهُ. \nقوله: « أرأيت... إلخ » معناه: أخبرني. \nوقوله: « وأحللت الحلال » أي اعتقدته حلالاً وفعلت منه الواجبات، «وحرمت الحرام » أي اعتقدته حراماً ولم أفعله. \nوقوله ﷺ: « نعم » أي تدخل الجنة.",
    "hadith": "الحديث الثاني والعشرون\n\nعن أبي عبد الله جابر بن عبد الله الأنصاري رضي الله عنهما: \"أن رجلاً سأل رسول الله ﷺ فقال: أرأيت إذا صلّيت المكتوبات، وصمت رمضان وأحللت الحلال وحرّمت الحرام ولم أزد على ذلك شيئاً أدخل الجنة؟ قال: نعم\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « الطهور شطر الإيمان » فسر الغزالي الطهور: بطهارة القلب من الغل والحسد والحقد وسائر أمراض القلب. وذلك أن الإيمان الكامل إنما يتم بذلك، فمن أتى بالشهادتين حصل له الشطر، ومن طهر قلبه من بقية الأمراض كمل إيمانه، ومن لم يطهر قلبه فقد نقص إيمانه. \nقال بعضهم: ومن طهر قلبه وتوضأ واغتسل وصلى، فقد دخل الصلاة بالطهارتين جميعاً، ومن دخل في الصلاة بطهارة الأعضاء خاصة فقد دخل بإحدى الطهارتين، والله سبحانه وتعالى لا ينظر إلا إلى طهارة القلب لقوله ﷺ: «إن الله لا ينظر إلى صوركم وأبشاركم ولكن ينظر إلى قلوبكم ». \nقوله ﷺ: « والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن أو تملأ ما بين السماء والأرض » وهذا قد يشكل على الحديث الآخر وهو أن موسى عليه الصلاة والسلام قال: « يا رب دلني على عمل يدخلني الجنة؟ قال: يا موسى قل: لا إله إلا الله، فلو وضعت السماوات السبع والأرضون السبع في كفة، ولا إله إلا الله في كفة، لرجحت بهم لا إله إلا الله ». ومعلوم أن السماوات والأرضين أوسع مما بين السماء والأرض، وإذا كانت الحمد لله تملأ الميزان وزيادة، لزم أن تكونا لحمد لله تملأ ما بين السماء والأرض لأن الميزان أوسع مما بين السماء الأرض، والحمد لله تملؤها. والمراد لو كان جسماً لملأ الميزان، أو أن ثواب الحمد لله يملؤها. \nقوله ﷺ: « والصلاة نور » أي ثوابها نور وفي الحديث: « بَشِّر الماشين في الظلم إلى المساجد بالنور التام يوم القيامة ». \nقوله ﷺ: « والصدقة برهان » أي دليل على صحة إيمان صاحبها، وسميت صدقة لأنها دليل على صدق إيمانه، وذلك أن المنافق قد يصلي، ولا تسهل عليه الصدقة غالباً. \nوقوله ﷺ: « والصبر ضياء » أي الصبر المحبوب، وهو الصبر على طاعة الله، والبلاء ومكاره الدنيا، ومعناه: لا يزال صاحبه مستمراً على الصواب. \nقوله ﷺ: « كل الناس يغدو فبائع نفسه » معناه كل إنسان يسعى لنفسه، فمنهم من يبيعها لله بطاعته فيعتقها من العذاب، ومنهم من يبيعها للشيطان والهوى باتباعهما «فيوبقها » أي يهلكها، قال عليه الصلاة والسلام: « من قال حين يصبح أو يمسي: اللهم إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وأنبياءك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك، وأن محمداً عبدك ونبيك، أعتق الله ربعه من النار، فإن قالها مرتين أعتق الله نصفه من النار، فإن قالها ثلاثاُ أعتق الله ثلاثة أرباعه من النار، فإن قالها أربعاً أعتق الله كله من النار ». \nفإن قيل: المالك إذا أتق بعض عبده سرى العتق إلى باقيه والله تعالى أعتق الربع الأول فلم يسر عليه وكذلك الباقي. \nفالجواب: إن السراية قهرية، والله تعالى لا تقع عليه الأشياء القهرية بخلاف غيره، ولا يقع في حكمه سبحانه ما لا يريد، قال الله تعالى: {إن الله اشترى من المؤمنين أنفسهم وأموالهم بأنّ لهمُ الجنةَ يُقاتلون في سبيلِ الله فَيَقتلون ويُقتَلون وعداً عليه حقاً في التوارة والإنجيل والقرآن ومن أوفى بعهده من الله فاستبشروا ببيِعكُم الذي بايعتم به وذلك هو الفوز العظيم }[التوبة: 111]. \nقال بعض العلماء: لم يقع بيع أشرف من هذا، وذلك أن المشتر ي هو الله، والبائع المؤمنون، والمبيع الأنفس، والثمن الجنة. \nوفي الآية دليل على أن البائع يجبر أولاً على تسليم السلعة قبل أن يقبض الثمن، وأن المشتري لا يجبر أولاً على تسليم الثمن. \nوذلك أن الله تعالى أوجب على المؤمنين الجهاد حتى يقتلوا في سبيل الله فأوجب عليهم أن يسلموا الأنفس المبيعة ويأخذوا الجنة. فإن قيل: كيف يشتري السيد من عبيده أنفسهم، والأنفس ملك له؟! قيل: كاتبهم ثم اشترى منهم، والله تعالى أوجب عليهم الصلوات الخمس والصوم وغير ذلك، فإذا أدّوا ذلك فهم أحرار، والله تعالى أعلم.",
    "hadith": "الحديث الثالث والعشرون\n\nعن أبي مالك الحارث بن عاصم الأشعري رضي الله عنه قال: قال رسول الله ﷺ: \"الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن أو تملأ بين السماء والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك. كل الناس يغدو؛ فبائع نفسه، فمعتقها، أو موبقها\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله عز وجل: « إني حرمت الظلم على نفسي » أي تقدست عنه، والظلم مستحيل في حق الله تعالى، فإن الظلم مجاوزة الحد والتصرف في ملك الغير وهما جميعاً محال في حق الله تعالى. \nقوله تعالى: « فلا تظالموا » أي فلا يظلم بعضكم بعضاً. \nقوله تعالى: « إنكم تَخطَأون بالليل والنهار » بفتح التاء والطاء على أنه من خطىء بفتح الخاء وكسر الطاء يخطأ في المضارع، ويجوز فيه ضم التاء على أنه من أخطاء، والخطأ يستعمل في العمد والسهو ولا يصح إنكار هذه اللغة ويرد عليه قوله تعالى: { إنَّ قَتْلهمُ كانَ خِطأً كبيراً }[الإسراء: 31]. بفتح الخاء والطاء وقرىء«خطئاً كبيراً » أيضاً. \nقوله تعالى: «لو أن أولكم وآخركم وإنسكم وجنكم »...إلخ دلت الأدلة السمعية والعقلية على أن الله مستغن في ذاته عن كل شيء، وأنه تعالى لا يتكثر بشيء من مخلوقاته، وقد بين الله تعالى أن له ملك السماوات والأرض وما بينهما، ثم بين أنهم مستغن عن ذلك قال تعالى: {يخلق الله ما يشاء }[آل عمران: 47]. وهو قادر على أن يذهب هذا الوجود ويخلق غيره، ومن قدر على أن يخلق كل شيء، فقد استغنى عن كل موجود، ثم بين سبحانه وتعالى أنه مستغن عن الشريك فقال تعالى: {ولم يكن له شريك في الملك }. ثم بين سبحانه وتعالى أنه مستغن عن المعين والظهير فقال تعالى: {ولم يكن له ولي من الذل }[الإسراء: 111]. فوصف العز ثابت أبداً، ووصف الذل منتف عنه تعالى، ومن كان كذلك فهو مستغن عن طاعة المطيع، ولو أن الخلق كلهم أطاعوا كطاعة أتقى رجل منهم، وبادروا إلى أوامره ونواهيه ولم يخالفوه، لم يتكثر سبحانه وتعالى بذلك، ولا يكون ذلك زيادة في ملكه، وطاعتهم إنما حصلت بتوفيقه وإعانته، وطاعتهم نعمة منه عليهم، ولو إنهم كلهم عصوه كمعصية أفجر رجل وهو إبليس، وخالفوه أمره ونهيه لم يضره ذلك ولم ينقص ذلك من كمال ملكه شيئاً، فإنه لو شاء أهلكهم وخلق غيرهم فسبحان من لا تنفعه الطاعة، ولا تضره المعصية. \nقوله تعالى: « فأعطيت كل واحد مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط اذا أدخل البحر » ومعلوم أن المخيط وهو الإبرة وذلك في المشاهدة لا تنقص من البحر شيئاً، والذي يتعلق بالمخيط لا يظهر له أثر في المشاهدة ولا الوزن. \nقوله تعالى: « فمن وجد خيراً فليحمد الله » أي على توفيقه لطاعته. \nقوله تعالى: « ومن وجد غير ذلك فلا يلومن إلا نفسه » حيث اعطاها مناها واتبع هواها.",
    "hadith": "الحديث الرابع والعشرون\n\nعن أبي ذر الغفاري رضي الله عنه عن النبي ﷺ فيما يرويه عن ربه -عزّ وجلّ- أنه قال: \"يا عبادي إني حرّمت الظلم على نفسي، وجعلته بينكم محرّماً؛ فلا تظالموا. يا عبادي كلكم ضال إلا من هديته؛ فاستهدوني أهدكم. يا عبادي كلكم جائع إلا من أطعمته؛ فاستطعموني أطعمكم. يا عبادي كلكـم عارٍ إلا مـن كسوته؛ فاستكسوني أكسكم. يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعاً؛ فاستغفروني أغفر لكم. يا عبادي إنكم لن تبلغوا ضرّي فتضرّوني ولن تبلغوا نفعي فتنفعوني. يا عبادي لو أن أوّلكم وآخركم وإنسكم وجنّكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا، يا عبادي لو أن أوّلكم وآخركم وإنسكم وجنّكم كانوا على أفجر قلب رجل واحد منكم ما نقص ذلك من ملكي شيئا. يا عبادي لو أن أوّلكم وآخركم وإنسكم وجنّكم قاموا في صعيد واحد فسألوني؛ فأعطيت كل واحد مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر. يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها؛ فمن وجد خيراً فليحمد الله، ومن وجد غير ذلك فلا يلومنَّ إلا نفسه\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله: قالوا يا رسول الله أيأتي أحدنا شهوته وله فيها أجر؟ قال: « أرأيتم لو وضعها في حرام أكان عليه وزر » اعلم أن شهوة الجماع أحبها الأنبياء والصالحون، قالوا: لما فيها من المصالح الدينية والدنيوية من غضِّ البصر وكسر الشهوة عن الزنا وحصول النسل الذي تتم به عمارة الدنيا وتكثر الأمة إلى يوم القيامة، قالوا: وسائر الشهوات يقسي تعاطيها القلب، إلا هذه فإنها ترقق القلب.",
    "hadith": "الحديث الخامس والعشرون\n\nعن أبي ذر رضي الله عنه أيضاً: أن ناساً من أصحاب رسول الله ﷺ قالوا للنبي ﷺ: يا رسول الله ذهب أهل الدثور بالأجور، يصلّون كما نصلي، ويصومون كما نصوم، ويتصدقون بفضول أموالهم، قال: \"أو ليس قد جعل الله لكم ما تصدقون؛ إن بكل تسبيحة صدقة، وكل تكبيرة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وأمر بالمعروف صدقة، ونهي عن منكر صدقة، وفي بضع أحدكم صدقة، قالوا: يا رسول الله! أيأتي أحدنا شهوته ويكون له فيها أجر؟ قال: أرأيتم لو وضعها في حرام أكان عليه وزر؟‍ فكذلك إذا وضعها في الحلال كان له أجر\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « كل سلامى من الناس عليه صدقة » والسلامى أعضاء الإنسان، وذكر أنها ثلاث مائة وستون عضواً منها صدقة كل يوم، وكل عمل بر من تسبيح أو تهليل أو تكبير أو خطوة يخطوها إلى الصلاة صدقة، فمن أدى هذه في أول يومه فقد أدى زكاة بدنه فيحفظ بقيته. \nوجاء في الحديث: « أن ركعتين من الضحى تقوم مقام ذلك ». \nوفي الحديث: « يقول الله تعالى: يا ابن آدم صلِّ لي أربع ركعات في أول اليوم أكفك في أول اليوم وأكفك في آخره ».",
    "hadith": "الحديث السادس والعشرون\n\nعن أبي هريرة رضي الله تعالى عنه قال: قال رسول الله ﷺ: \"كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس تعدل بين اثنين صدقة، وتعين الرجل في دابته فتحمله عليها أو ترفع له عليها متاعه صدقة، والكلمة الطيبة صدقة، وبكل خطوة تمشيها صدقة، وتميط الأذى عن الطريق صدقة\". (رواه البخاري ومسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « البر حسن الخلق » وقد تقدم الكلام في حسن الخلق، قال ابن عمر: البر أمر هين، وجه طلق ولسان لين. وقد ذكر الله تعالى آية جمعت أنواع البر فقال تعالى: {ولكن البرَّ مَنْ آمَنَ بالله واليومِ الآخر } [البقرة177]. \nقوله ﷺ: « والإثم ما حاك في نفسك » أي اختلج وتردد ولم تطمئن النفس إلىفعله، وفي الحديث دليل على أن الإنسان يراجع قلبه إذا أراد الإقدام على فعل شيء فإن اطمأنت عليه النفس فعله وإن لم تطمئن تركه، وقد تقدم الكلام على الشبهة في حديث « الحلال بين والحرام بين ». ويروى أن آدم عليه الصلاة والسلام أوصى بنيه بوصايا، منها أنه قال: إذا أردتم فعل شيء فإن اضطربت قلوبكم فلا تفعلوه، فإني لما دنوت من أكل الشجرة اضطرب قلبي عند الأكل. ومنها أنه قال: إذا أردتم فعل شيء فانظروا في عاقبته فإني لو نظرت في عاقبة الأكل ما أكلت من الشجرة. ومنها أنه قال: إذا أردتم فعل شيء فاستشيروا الأخيار فإني لو استشرت الملائكة لأشاروا عليّ بترك الأكل من الشجرة. \nقوله ﷺ: « وكرهت أن يطلع عليه الناس » لأن الناس قد يلومون الإنسان على أكل الشبهة وعلى أخذها وعلى نكاح امرأة قد قيل إنها أرضعت معه ولهذا قال ﷺ: « كيف وقد قيل ». وكذلك الحرام إذا تعاطاه الشخص يكره أن يطلع عليه الناس، ومثال الحرام الأكل من مال الغير، فإن يجوز إن كان يتحقق رضاه، فإن شك في رضاه حرم الأكل، وكذلك التصرف في الوديعة بغير إذن صاحبها، فإن الناس إذا اطلعوا على ذلك أنكروه عليه، وهو يكره اطلاع الناس على ذلك لأنهم ينكرون عليه. \nقوله ﷺ: « ما حاك في النفس، وإن أفتاك الناس وأفتوك ». \nمثاله الهدية إذا جاءتك من شخص، غالب ماله حرام، وترددت النفس في حلها، وأفتاك المفتي بحل الأكل فإن الفتوى لاتزيل الشبهة، وكذلك إذا أخبرته امرأة بأنه ارتضع مع فلانة، فإن المفتي إذا أفتاه بجواز نكاحها لعدم استكمال النصاب لا تكون الفتوى مزيلة للشبهة، بل ينبغي الورع وإن أفتاه الناس، والله أعلم.",
    "hadith": "الحديث السابع والعشرون\n\nعن النواس بن سمعان رضي الله عنهما عن النبي ﷺ قال: \"البر حسن الخلق، والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس\". (رواه مسلم)\nوعن وابصة بن معبد رضي الله عنه قال: أتيت رسول الله ﷺ فقال: \"جئت تسأل عن البر؟ قلت نعم، قال: استفت قلبك، البر ما اطمأنت إليه النفس، واطمأن إليه القلب، والإثم ما حاك في النفس، وتردد في الصدر، وإن أفتاك الناس وأفتوك\". (حديث حسن رويناه في مسندي الإمامين: أحمد بن حنبل والدارمي بإسناد حسن)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله: «وعظنا » الوعظ هو التخويف. \nقوله: «وذرفت منها العيون » أي بكت ودمعت. \nقوله ﷺ: « عليكم بسنتي »أي عند اختلاف الأمور الزموا سنتي، وعضوا عليها بالنواجذ وهي مؤخر الأضراس وقيل: الأنياب، والإنسان متى عض بنواجذه كأن يجمع أسنانه فيكون مبالغة، فمن العض على السنة الأخذ بها وعدم اتباع آراء أهل الأهواء والبدع، وعضوا: فعل أمر من عض يعض، وهو بفتح العين، وضمها لحن، ولذلك تقول: بر أمك يازيد، لأنه من بر يبر ولا تقول، بر إمك بضم الباء. \nقوله ﷺ: «وسنة الخلفاء الراشدين المهديين » رضي الله عنهم، يريد الأربعة وهم: أبوبكر، وعمر وعثمان، وعلي.",
    "hadith": "الحديث الثامن والعشرون\n\nعن أبي نجيح العرباض بن سارية رضي الله عنه قال: وعظَنا رسول الله ﷺ موعظةً وجلت منها القلوب وذرفت منها العيون، فقلنا: يا رسول الله كأنها موعظة مودّع، فأوصِنا، قال: أوصيكم بتقوى الله عزّ وجلّ، والسمع والطاعة وإن تأمر عليكم عبد، فإنه من يعش منكم فسيرى اختلافاً كثيراً، فعليكم بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ، وإياكم ومحدثات الأمور، فإن كل بدعة ضلالة، وكل ضلالة في النار\". (رواه أبو داود والترمذي وقال حديث حسن صحيح)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « وذرون سنامة » أي أعلاه، و«مِلاك الشيء » بكسر الميم: أي مقصوده. \nقوله ﷺ: « ثكلتك أمك » أي فقدتك، ولم يقصد رسول الله ﷺ حقيقة الدعاء بل جرى ذلك على عادة العرب في المخاطبات، و« حصائد ألسنتهم » جناياتها على الناس بالوقوع في أعراضهم والمشي بالنميمة ونحو ذلك، وجنايات اللسان: الغيبة والنميمة والكذب والبهتان وكلمة الكفر والسخرية وخلف الوعد، قال الله تعالى: {كَبُرَ مقتاً عِنْدَ الله أنْ تقولوا ما لا تَفْعَلون } [الصف: 30].",
    "hadith": "الحديث التاسع والعشرون\n\nعن معاذ بن جبل رضي الله عنه قال: قلت يا رسول الله أخبرني بعمل يدخلني الجنة ويباعدني عن النار؟ قال: لقد سألت عن عظيم وإنه ليسير على من يسره الله تعالى عليه: تعبد الله لا تشرك به شيئاً، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت، ثم قال: ألا أدلك على أبواب الخير؟ الصوم جنة، والصدقة تطفئ الخطيئة كما يطفئ الماء النار، وصلاة الرجل في جوف الليل، ثم تلا: (تتجافى جنوبهم عن المضاجع) حتى بلغ (يعملون) ثم قال: ألا أخبرك برأس الأمر وعموده وذروة سنامه؟ قلت: بلى يا رسول الله، قال: رأس الأمر الإسلام، وعموده الصلاة، وذروة سنامه الجهاد، ثم قال: ألا أخبرك بملاك ذلك كله؟ قلت: بلى يا رسول الله، فأخذ بلسانه، وقال: كفّ عليك هذا، قلت يا نبي الله وإنا لمؤاخذون بما نتكلم به؟ فقال ثكلتك أمك يا معاذ، وهل يكب الناس في النار على وجوههم أو قال: على مناخرهم إلا حصائد ألسنتهم\". (رواه الترمذي وقال: حديث حسن صحيح)"
  },
  {
    "description": "شرح وفوائد الحديث\nوقوله ﷺ: « حرم أشياء فلا تنتهكوها » أي فلا تدخلوا فيها. \nقوله ﷺ: « وسكت عن أشياء رحمة لكم » تقدم معناه.",
    "hadith": "الحديث الثلاثون\n\nعن أبي ثعلبة الخشني جرثوم بن ناشر رضي الله عنه عن رسول الله ﷺ قال: \" إن الله تعالى فرض فرائض فلاتضيعوها، وحد حدوداً فلا تعتدوها، وحرّم أشياء فلا تنتهكوها، وسكت عن أشياء رحمةً لكم غير نسيان فلا تبحثوا عنها\". (حديث حسن رواه الدارقطني وغيره)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ« ازهد في الدنيا يحبك الله) ) الزهد: ترك ما لا يحتاج إليه من الدنيا، وإن كان حلالاً، والاقتصار على الكفاية، والورع: ترك الشبهات قالوا: وأعقل الناس الزهاد، لأنهم أحبوا ما أحب الله، وكرهوا ما كره الله من جمع الدنيا، واستعلموا الراحة لأنفسهم. قال الشافعي رحمه الله تعالى: لو أوصى لأعقل الناس صرف للزهاد. \nأو ما ترى الخطّاف حرَّم زادهم --- فغدا رئيساً في الحجور قريباً \nوللشافعي رضي الله عنه في ذم الدنيا قوله: « حرام على نفس التقي ارتكابها » يدل على تحريم الفرح بالدنيا، وقد صرح بذلك البغوي في تفسير قوله تعالى: {وفرحوا بالحياة الدنيا} [الرعد: 26]. ثم المراد بالدنيا بالمذمومة: طلب الزائد على الكفاية، أما طلب الكفاية فواجب، قال بعضهم: وليس ذلك من الدنيا، وأما الدنيا فالزائدة على الكفاية، واستدل بقوله تعالى: { زُيِّن للناسِ حُبُّ الشهواتِ من النساءِ والبَنِينَ والقناطير المقنطرة من الذهب والفضة والخيل المسوُّمِة والأنعامِ والحرث ذلك متاعُ الحياةِ الدنيا والله عنده حسن المآب }[آل عمران: 14]. فقوله تعالى ذلك إشارة إلى ما تقدم من طلب التوسع والتبسط، قال الشافعي رحمه تعالى: طلب الزائد من الحلال عقوبة ابتلى الله بها أهل التوحيد. ثم بعد ذلك إذا فرح بها لأجل المباهاة والتفاخر والتطاول على الناس فهو مذموم، ومن فرح بها لكونها من فضل الله عليه فهو محمود. \nقال عمر رضي الله عنه: اللهم إنا لا نفرح إلا بما رزقتنا. \nوقد الله تعالى المقتصدين في العيش فقال تعالى: {والذين إذا أنفقوا لم يُسرفوا ولم يَقتُروا وكان بين ذلك قواما ً}[الفرقان: 67]. \nوقال ﷺ: « ما خاب من استخار ولا ندم من استشار، ولا افتقر من اقتصد ». وكان يقال: القصد في المعيشة يكفي عنك نصف المؤنة، والاقتصاد: الرضى بالكفاية، قال بعض الصالحين: من اكتسب طيباً وأنفق قصداً قدم فضلاً.",
    "hadith": "الحديث الحادي والثلاثون\n\nعن أبي العباس سهل بن سعد الساعدي رضي الله عنه قال: جاء رجل إلى النبي ﷺ فقال: يا رسول الله دلّني على عمل إذا عملته أحبني الله وأحبني الناس، فقال: \"ازهد في الدنيا يحبك الله، وازهد فيما عند الناس يحبك الناس\". (حديث حسن، رواه ابن ماجه وغيره بأسانيد حسنة)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « لا ضرار » أي لا يضر أحدكم أحداً بغير حق ولا جناية سابقة. \nقوله ﷺ: « ولا ضرار » أي لاتضر من ضرك، وإذا سبك أحد فلا تسبه، وإن ضربك فلا تضربه، بل اطلب حقك منه عند الحاكم من غير مسابة، وإذا تساب رجلان أو تقاذفا لم يحصل التقاص، بل كل واحد يأخذ حقه بالحاكم، وفي الحديث عنه ﷺ قال: « للمتسابين ما قالا، وعلى البادي منهما الإثم، ما لم يعتد المظلوم بسبب زائد ».",
    "hadith": "الحديث الثاني والثلاثون\n\nعن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنه أن رسول الله ﷺ قال: \"لا ضرر ولا ضرار\". (حديث حسن رواه ابن ماجه والدارقطني وغيرهما مسنداً، ورواه مالك في الموطأ مرسلاً عن عمرو بن يحيى عن أبيه عن النبي ﷺ فأسقط أبا سعيد، وله طرق يقوي بعضها بعضاً)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ «البينة على المدعي واليمين على من أنكر » إنما كانت البينة على المدعي لأنه يدعي خلاف الظاهر والأصل براءة الذمة، وإنما كانت اليمين في جانب المدعى عليه لأنه يدعي ما وافق الأصل وهو براءة الذمة. \nويستثنى مسائل، فيقبل المدعي بلا بينة فيما لا يعلم إلا من جهته كدعوى الأب حاجة إلى الإعفاف، ودعوى السفيه التوقان إلى النكاح مع القرينة، ودعوى الخنثى الأنوثة والذكورة، ودعوى الطفل البلوغ بالاحتلام، ودعوى القريب عدم المال ليأخذ النفقة، ودعوى المدين الإعسار في دين لزمه بلا مقابل، كصداق الزوجة، والضمان، وقيمة المتلف، ودعوى المرأة انقضاء العدة بالإقراء، أو بوضع الحمل، ودعواها أنها استحلت وطلقت، ودعوى المودع تلف الوديعة أو ضياعها بسرقة ونحوها. \nويستثنى أيضاً: القسامة فإن الإيمان يكون في جانب المدعي مع اللوث، واللِعان فإن الزوج يقذف ويلاعن ويسقط عنه الحدود، ودعوى الوطء في مدة اللعنة، فإن المرأة اذا أنكرته يصدق الزوج بدعواه، إلا أن تكون الزوجة بكراً، وكذا لو ادعى أنه وطىء في مدة الإيلاء، وتارك الصلاة إذا قال: صليت في البيت، ومانع الزكاة إذا قال: أخرجتها إلا أن ينكر الفقراء وهم محصورون فعليه البينة، وكذا لو ادعى الفقر وطلب الزكاة أعطي ولا يحلف، بخلاف ما إذا ادعى العيال فإنه يحتاج إلى البينة، ولو أكل في يوم الثلاثين من رمضان وادعى أنه رأى الهلال لم يقبل منه إن ادعى ذلك بعد الأكل، فإنه ينفي عن نفسه التعزير، وإذا ادعى ذلك قبل الأكل قبل ولم يعزر، وينبغي أن يأكل سراً لأن شهادته وحده لا تقبل. \nقوله ﷺ: « واليمين على من أنكر » هذه اليمين تسمى يمين الصبر، وتسمى الغموس، وسميت يمين الصبر لأنها تحبس صاحب الحق عن حقه والحبس: الصبر، ومنه قيل للقتيل والمحبوس عن الدفن مصبر، قال ﷺ: « من حلف على يمين صبر يقتطع به مال امرئ مسلم هو فيها فاجر لقي وهو عليه غضبان » وهذه اليمين لا تكون إلا على الماضي، ووقعت في القرآن العظيم في مواضع كثيرة: منها قوله تعالى: {يحِلُفون بالله ما قالوا } [التوبة: 74]، ومنها قوله تعالى إخباراً عن الكفرة: {ثم لم تكن فتنتهم إلا أن قالوا: والله ربّنا ما كُنَّا مُشرِكين }[الأنعام: 23]. ومنها قوله تعالى: {إنَّ الذين يشترون بعهدِ الله وأيمانهم ثمناً قليلاً أولئك لاخلاق لهم في الآخرة ولا يُكلمُهُم اللهُ ولا ينظرُ إليهم يوم القيامةِ ولا يُزكيهمْ ولُهمْ عذابِّ أليم }[آل عمران: 77]. \nويستحب للحاكم أن يقرأ هذه الآية عن تحليفه للخصم لينزجر.",
    "hadith": "الحديث الثالث والثلاثون\n\nعن ابن عباس رضي الله عنهما أن رسول الله ﷺ قال: \"لو يعطى الناس بدعواهم، لادعى رجال أموال قوم ودماءهم، لكن البينة على المدعي واليمين على من أنكر\". (حديث حسن رواه البيهقي وغيره هكذا، وبعضه في الصحيحين)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « وذلك أضعف الإيمان » ليس المراد أن العاجز إذا أنكر بقلبه يكون إيمانه أضعف من إيمان غيره، وإنما المراد أن ذلك أدنى الإيمان وذلك أن العمل ثمرة الإيمان، وأعلى ثمرة الإيمان في باب النهي عن المنكر أن ينهي بيده، وإن قتل كان شهيداً، قال الله تعالى حاكياً عن لقمان: {يا بُنَّي أقِمِ الصلاةَ وأمُرْ بالمعروفِ وانْه عن المُنكَرِ واصبِرْ على ما أصابَك }[لقمان: 17] ويجب النهي على القادر باللسان وإن لم يسمع منه، كما إذا علم أنه إذا سلم لا يُرد عليه السلام فإنه يسلم. \nفإن قيل قوله ﷺ: «فإن، لم يستطع فبلسانه، فإن لم يستطع فبقلبه » يقتضي أن غير المستطيع لا يجوز له التغيير بغير القلب والأمر للوجوب. فجوابه من وجهين: احدهما أن المفهوم مخصص بقوله تعالى: {واصبر على ما أصابك }. \nوالثاني أن الأمر فيه يعني رفع الحرج لا رفع المستحب. فإن قيل الإنكار بالقلب ليس تغيير المنكر فما معنى قوله ﷺ «فبقلبه ». \nفجوابه: أن المراد أن ينكر ذلك ولا يرضاه ويشتغل بذكر الله، وقد مدح الله تعالى العاملين بذلك فقال: {وإذا مرُّوا باللّغو مرُّوا كراماً }[الفرقان: 72].",
    "hadith": "الحديث الرابع والثلاثون\n\nعن أبي سعيد الخدري رضي الله عنه قال: سمعت رسول الله ﷺ يقول: \"من رأى منكم منكراً فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « لا تحاسدوا » قد تقدم أن الحسد على ثلاثة أنواع. والنجش: أصله الارتفاع والزيادة، وهو أن يزيد في ثمن سلعة ليغر غيره، وهو حرام، لأنه غش وخديعة.\nوقوله ﷺ: « ولا تدابروا » أي لا يهجر أحدكم أخاه وإن رآه أعطاه دبره أو ظهره قال ﷺ: « لا يحل لمسلم أن يهجر أخاه فوق ثلاثة أيام يلتقيان فيُعرض هذا ويُعرض هذا وخيرهما الذي يبدأ بالسلام ».\nوالبيع على بيع أخيه، صورته: أن يبيع أخوه شيئاً فيأمر المشتري بالفسخ ليبيعه مثله أ وأحسن منه بأقبل من ثمن ذلك، والشراء علىالشراء حرام: بأن يأمر البائع بالفسخ ليشتريه منه بأغلى ثمن، وكذلك يحرم السوم على سوم أخيه، وكل هذا داخل في الحديث لحصول المعنى، وهو التباغض والتدابر، وتقييد النهي ببيع أخيه يقتضي أنه لا يحرم على بيع الكافر، وهو وجه لابن خالويه، والصحيح لا فرق لأنه من باب الوفاء بالذمة والعهد. \nقوله ﷺ: « التقوى ههنا » وأشار بيده إلى صدره وأراد القلب، وقدتقدم قوله ﷺ: « ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله » قوله صلى الله عليه وسلك: « ولا يخذله » أي عند أمره بالمعروف أو نهيه عن المنكر، أو عند مطالبته بحق من الحقوق، بل ينصره ويعينه ويدفع عنه الأذى ما استطاع. \nوقوله ﷺ: « ولا يحقره » أي فلا يحكم على نفسه بأنه خير من غيره، بل يحكم على غيره بأنه خير منه، أو لا يحكم بشيء فإن العاقبة منطوية ولا يدري العبد بما يختم له، فإذا رأى صغيراً مسلماً حكم بأنه خير منه باعتبار أنه أخف ذنوباً منه، وإن رأى من هو أكبر سناً منه حكم له بالخيرية باعتبار أنه أقدم هجره مه في الإسلام، وإن رأى كافراً لم يقطع له بالنار لا حتمال أنه يسلم فيموت مسلماً. \nقوله ﷺ: « بحسب امرىء من الشر ». أي يكفيه من الشر « أن يحقر أخاه » يعني أن هذا شر عظيم يكفي فاعله عقوبة هذا الذنب.. \nقوله ﷺ: « كل المسلم إلخ » قال في حجة الوداع: « إن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في بلدكم هذا ». واستدل الكرابيسي بهذا الحديث على أن الغيبة الوقوع في عرض المسلمين كبيرة إما لدلالة الاقتران بالدم والمال إما لتشبيه بقوله: « كحرمة يومكم هذا في شهركم هذا في بلدكم هذا » وقد توعد الله تعالى بالعذاب الأليم عليه فقال تعالى: {وَمَنْ يُرِدْ فِيهِ بِإِلْحَادٍ بِظْلمٍ نُذِقْهُ مِنْ عَذَابٍ أليمٍ }[الحج: 25].",
    "hadith": "الحديث الخامس والثلاثون\n\nعن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: \"لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا تدابروا، ولا يبع بعضكم على بيع بعض، وكونوا عباد الله إخواناً، المسلم أخو المسلم لا يظلمه ولا يخذله، ولا يكذبه ولا يحقره، التقوى ههنا -ويشير إلى صدره ثلاث مرات- بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام؛ دمه وماله وعرضه\". (رواه مسلم)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « من نفس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة » فيه دليل على استحباب خلاص الأسير من أيدي الكفار بماله يعطيه، وعلى تخليص المسلم من أيدي الظلمة وخلاصه من السجن.يقال: إن يوسف عليه السلام لما خرج من السجن كتب على بابه: « هذا قبر الأحياء، وشماتة الأعداء، وتجربة الأصدقاء ». ويدخل في هذا الباب الضمان عن المعسر، والكفالة ببدنه، لمن هو قادر عليه، أما العاجز فلا ينبغي له ذلك، وقال بعض أصحاب القفال: إن في التوراة مكتوباً: « الكفالة مذمومة » أولها ندامة وأوسطها ملامة، وآخرها غرامة ». فإن قيل: قال الله تعالى: {ومن جاء بالحسنة فله عَشْرُ أمثالها }[الأنعام: 160]. وهذا الحديث يدل على أن الحسنة بمثلها لأنها قوبلت بتنفيس كربة واحدة، ولم تقابل بعشر كرب من يوم القيامة. \nفجوابه من وجهين: أحدهما أن هذا من باب مفهوم العدد، والحكم المعلق بعدد لا يدل على نفي الزيادة والنقصان. \nوالثاني: أن كل كربة من كرب يوم القيامة تشتمل على أهوال كثيرة وأحوال صعبة ومخاوف جمة، وتلك الأهوال تزيد علىالعشرة وأضعافها. وفي الحديث سر آخر مكتوم يظهر بطريق اللازم للملزوم، وذلك أن فيه وعداً بإخبار الصادق: أن من نفس الكربة عن المسلم يختم له بخير، ويموت على الإسلام، لأن الكفار لا يرحم في دار الآخرة ولا ينفس عنه من كربه شيء، ففي الحديث إشارة إلى بشارة تضمنتها العبارة الواردة عن صاحب الإمارة، فبهذا الوعد العظيم فليثق الواثقون {لمثل هذا فليعمل العاملون }[الصافات: 61].فأفضل العمل تنفيس الكرب. \nوفي الحديث دليل على استحباب ستر المسلم إذا اطلع عليه أنه عمل فاحشة قال الله تعالى: {إنَّ الذين يحبون أن تشيع الفاحشة في الذين آمنوا، لهم عذاب أليم في الدنيا والآخرة }[النور: 19]. والمستحب للإنسان إذا اقترف ذنباً أن يستر علىنفسه، وأما شهود الزنا، فاختلف فيهم على وجهين، احدهما: يستحب لهم الستر، والثاني: الشهادة. \nوفصل بعضهم فقال: إن رأوا مصلحة في الشهادة شهدوا، أو في الستر ستروا. \nوفي الحديث دليل على استحباب المشي في طلب العلم، ويروى أن الله سبحانه وتعالى أوحى إلى داود عليه الصلاة والسلام: أن خذ عصا من حديد ونعلين من حديد وامش في طلب العلم حتى يتخرق النعلان وتتكسر العصا. \nوفيه دليل على خدمةالعلماء وملازمتهم والسفر معهم واكتساب العلم منهم، قال الله تعالى حاكياً عن موسى عليه الصلاة والسلام: {هل أَتِبعُكَ على أن تعلمني مما علمت رُشداً }[الكهف: 66]. \nوعلم أن هذا الحديث له شرائط، منها العمل بما يعلمه، وقال أنس رضي الله عنه: العلماء همتهم الرعاية، والسفهاء همتهم الرواية. \nومن شرائطه نشره قال الله تعالى: {فلولا نفر من كل فرقة منهم طائفة لَيتَفَقَّهُوا في الدين ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون }[التوبة: 122]. وروى أنس رضي الله تعالى عنه أن النبي ﷺ قال لأصحابه: «ألا أخبركم عن أجود الأجواد » قالوا بلى يا رسول الله، قال: « الله أجود الأجواد، وأنا أجود ولد آدم، وأجودهم بعدي رجل علم علماً فنشره يبعث يوم القيامة أمةوحده، ورجل بنفسه في سبيل الله حتى قتل ». \nومن شرائطه ترك المباهاة والممارة. وروي عن النبي ﷺ أنه قال: « من طلب العلم لأربعة دخل النار: ليباهي به العلماء، أو يماري به السفهاء، أو يأخذ به الأموال، أو يصرف به وجوه الناس إليه ». \nومن شرائطه الاحتساب في نشره وترك البخل به، قال الله تعالى: {قل لا أسألكم عليه أجراً }[الأنعام: 90]. \nومن شرائطه ترك الأنفة من قول لا أدري، قال ﷺ في علو مرتبته لما سئل عن الساعة: « ما المسؤول عنها بأعلم من السائل ». وسئل عن الروح فقال: « لا أدري ». \nومن شرائطه التواضع قال الله تعالى: {وعبادُ الرحمن الذين يمشون على الأرض هونا ً}[الفرقان63]. قال ﷺ لأبي ذر: « يا أبا ذر احفظ وصية نبيك عسى أن ينفعك الله بها، تواضع لله عز وجل عسى أن يرفعك القيامة، وسلم على من لقيت من أمتي برَّها وفاجرها، والبس الخشن من الثياب، ولاتُرِدْ بذلك إلا وجه الله تعالى، لعل الكبر والحمية لا يجدان في قبلك مساغاً ». \nومن شرائطه احتمال الأذى في بذل النصيحة والاقتداء بالسلف الصالح في ذلك قال الله تعالى: {وأنه عن المنكر واصبر على ما أصابك}[لقمان: 17]. وقال ﷺ: «ما أوذي نبِّي مثل ما أوذيت ». \nومن شرائطه أن يقصد بعلمه من كان أحوج إلى التعليم، كما يقصد بالصدقة بالمال الأحوج فالأحوج، فمن أحيا جاهلاُ بتعليم العلم فكأنما أحيا الناس جمعياً، ومما قيل في تنبيه الغافل ورده إلى الطاعة. \nقوله ﷺ: « إلا نزلت عليه السكينة » هي فعيلة من السكون، أي الطمأنينة من الله، قال الله تعالى: {ألا بذكرِ تطمَئِنُّ القلوب }[الرعد: 28]. وكفى بذكر الله شرفاً ذكر الله العبد في الملأ الأعلى. \nقوله ﷺ: « ومن بطأ به عمله » أي وإنكان نسيباً « لم يسرع به نسبه » إلى الجنة فيقدم العامل بالطاعة ولو كان عبداً حبشياً على غير العامل ولو كان شريفاً قرشياً، قال الله تعالى: {إن أكرمكم عند الله أتقاكم }[الحجرات: 13].",
    "hadith": "الحديث السادس والثلاثون\n\nعن أبي هريرة رضي الله عنه عن النبي ﷺ قال: \"من نفّس عن مؤمن كربةً من كرب الدنيا نفّس الله عنه كربةً من كرب يوم القيامة، ومن يسّر على معسر يسّر الله عليه في الدنيا والآخرة، ومن ستر مسلماً ستره الله في الدنيا والآخرة، والله في عون العبد ما كان العبد في عون أخيه، ومن سلك طريقاً يلتمس فيه علماً سهّل الله له به طريقاً إلى الجنة، وما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله ويتدارسونه بينهم إلا نزلت عليهم السكينة، وغشيتهم الرحمة، وحفّتهم الملائكة، وذكرهم الله فيمن عنده، ومن بطّأ به عمله لم يسرع به نسبه\". (رواه مسلم بهذا اللفظ)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « كتبها الله عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة » روى البزار في مسنده أنه ﷺ قال: (الأعمال سبعة: عملان موجبان، وعملان واحد بواحد، وعمل الحسنة فيه بعشرة، وعمل الحسنة فيه بسبعمائة ضعف، وعمل لا يحصي ثوابه إلا الله تعالى. فأما العملان الموجبان فالكفر والإيمان، فالإيمان يوجب الجنة والكفر يوجب النار، وأما العملان اللذان هما واحد بواحد، فمن هم بحسنة ولم يعملها كتبها الله له حسنة، ومن عمل سيئة كتب الله عليه سيئة واحدة، وأما العمل الذي بسبعمائة ضعف فهو الجهاد في سبيل الله تعالى: { كمثل حبةٍ أنْبتَتْ سبع سنابل في كل سنبلة مائةُ حبة }[البقرة: 26]. ثم ذكر الله سبحانه وتعالى أنه يضاعف لمن يشاء زيادة على ذلك، وقال الله تعالى: {وإن تكُ حَسَنة يضاعفها ويؤتِ من لدنه أجراً عظيما ً}[النساء: 40].فدلت الآية والحديث وهو قوله ﷺ: «إلى أضعاف كثيرة » إن العشر والسبعمائة كلمة ليست للتحديد وأنه يضاعف لمن يشاء ويعطي من لدنه ما لا يعد ولا يحصى فسبحان من لا تحصى آلاؤه ولا تعد نعماؤه فله الشكر والنعمة والفضل. \nوأما السابع فهو الصوم، «يقول الله تعالى: كُلُّ عَمَلِ ابْن آدم له إلا الصومُ فإنَّهُ لي وأنا أجزي به ». فلا يعلم ثواب الصوم إلا الله.",
    "hadith": "الحديث السابع والثلاثون\n\nعن ابن عباس رضي الله عنهما عن رسول الله ﷺ فيما يرويه عن ربه تبارك وتعالى قال: \"إن الله كتب الحسنات والسيئات، ثم بين ذلك، فمن همّ بحسنة فلم يعملها كتبها الله عنده حسنةً كاملةً، وإن همّ بها فعملها كتبها الله عنده عشر حسنات إلى سبعمائة ضعف، وإن همّ بسيئة فلم يعملها كتبها الله عنده حسنةً كاملةً، وإن هم بها فعملها كتبها الله سيئةً واحدةً\". (رواه البخاري ومسلم في صحيحيهما بهذه الحروف)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ عن ربه تعالى: «من عادى لي ولياً فقد آذنته بالحرب » المراد هنا بالولي: المؤمن قال الله تعالى: {الله ولي الذين آمنوا }[البقرة: 257].فمن آذى مؤمناً فقد آذنه الله، أي أعلمه الله أنه محارب له، والله تعالى إذا حارب العبد أهلكه، فليحذر الإنسان من التعرض لكل مسلم قوله تعالى: « وما تقرب إليَّ عبدي بشيء أحب إليًّ مما افترضته عليه » فيه دليل على أن فعل الفريضة من أفضل النوافل، وجاء في الحديث: «إن ثواب الفريضة يفضل على ثواب النافلة بسبعين مرة ». \nقوله تعالى: « ولا يزال عبدي يتقرب إليَّ بالنوافل حتى أحبه » ضرب العلماء رضي الله تعالى عنهم لذلك مثلاً فقالوا: مثل الذي يأتي بالنوافل مع الفرائض، ومثل غيره كمثل رجل أعطى لأحد عبديه درهماً ليشتري به فاكهة، وأعطى آخر درهماً ليشتري فاكهة، فذهب أحد العبدين فاشترى فاكهة فوضعها في قوصرة، وطرح عليها ريحاناً ومشموماً من عنده، ثم جاء فوضعها بين يدي السيد، وذهب الآخر واشترى الفاكهة في حجره ثم جاء فوضعها بين يدي السيد على الأرض، فكل واحد من العبدين قد امتثل، لكن أحدهما زاد من عنده القوصرة والمشموم فيصير أحب إلى السيد. فمن صلى النوافل مع الفرائض يصير أحب إلى الله، والمحبة من الله إرادة الخير، فإذا أحب عبده شغله بذكره وطاعته وحفظه من الشيطان، واستعمل أعضاءه في الطاعة، وحبب إليه سماع القرآن والذكر وكرَّه إليه سماع الغناء وآلات اللهو وصار من الذين قال الله تعالى: {وإذا خاطبهم الجاهلون قالوا سلاماً }[الفرقان: 63].فإذا سمعوا منهم كلاماً فاحشاً أضربوا عنه وقالوا قولاً يسلمون فيه، وحفظ بصره عن المحارم فلا ينظر إلى ما لا يحل له، وصار نظره فكر واعتبار، فلا يرى شيئاً من المصنوعات إلا استدل به على خالقه. وقال على رضي الله عنه: ما رأيت شيئاً إلا ورأيت الله تعالى قبله. ومعنى الاعتبار العبور الفكر في المخلوقات إلى قدرة الخالق، فيسبح عند ذلك ويقدس ويعظم وتصير حركاته باليدين والرجلين كلها لله تعالى ولا يمشي فيما لا يعنيه ولا يفعل بيده شيئاً عبثاً بل تكون حركاته وسكناته لله تعالى، فيثاب على ذلك في حركاته وسكناته وفي وفي سائر أفعاله. \nقوله تعالى: «كنت سمعه »يحتمل كنت الحافظ لسمعه ولبصره ولبطش يده ورجله من الشيطان، ويحتمل كنت في قلبه عند سمعه وبصره وبطشه. فإذا ذكرني كفَّ عن العمل لغيري.",
    "hadith": "الحديث الثامن والثلاثون\n\nعن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: \"إن الله تعالى قال: من عادى لي ولياً فقد آذنته في الحرب، وما تقرّب إليّ عبدي بشيء أحبّ إليّ مما افترضته عليه، ولا يزال عبدي يتقرب إليّ بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي بها، ولئن سألني لأعطينّه، ولئن استعاذني لأعيذنّه\". (رواه البخاري)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: «إن الله تعالى تجاوز لي عن أمتي الخطأ والنسيان وما استكرهوا عليه »أي تجاوز عنهم إثم الخطأ والنسيان وما استكرهوا عليه، وأما حكم الخطأ والنسيان والمكره عليه فغير مرفوع، فلو أتلف شيئاً خطأ أو ضاعت منه الوديعة نسياناً ضمن، ويستثنى من الإكراه علىالزنا والقتل فلا يباحان بالإكراه، ويستثنى من النسيان ما تعاطى الإنسان سببه فإنه يأثم بفعله لتقصيره.",
    "hadith": "الحديث التاسع والثلاثون\n\nعن ابن عباس رضي الله عنهما أن رسول الله ﷺ قال: \"إن الله تجاوز لي عن أمتي الخطأ والنسيان وما استكرهوا عليه\". (حديث حسن رواه ابن ماجه والبيهقي وغيرهما)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « كن في الدنيا كأنك غريب أو عابر سبيل » أي لا تركن إليها ولا تتخذها وطناً ولا تحدث نفسك بالبقاء فيها ولا تتعلق منها إلا بما يتعلق الغريب به في غير وطنه الذي يريد الذهاب منه إل أهله، وهذا معنى قول سلمان الفارسي رضي الله عنه: أمرني خليلي ﷺ أن لا أتخذ من الدنيا إلا كمتاع الراكب. \nوفي الحديث دليل على قصر الأمل وتقديم التوبة والاستعداد للموت فإن أمل فليقل إن شاء الله تعالى، قال الله تعالى: {ولا تقولن لشيء إني فاعل ذلك غداً إلا أن يشاء الله } [الكهف: 23-24]. \nقوله: «وخذ من صحتك » أمره ﷺ أن يغتنم أوقات الصحة بالعمل الصالح فيها، فإنه يعجز عن الصيام والقيام ونحوها لعلة تحصل من المرض والكبر. \nوقوله ﷺ: « ومن حياتك لموتك »، أمره ﷺ بتقديم الزاد. وهذا كقوله تعالى: {نظر نفسٌ ما قَدَّمتْ لِغد ٍ}[الحشر: 18]. لا يفرط فيها حتى يدركه الموت فيقول: {رب ارجعونِ لعلي أعمل صالحاً فيما تركت }[المؤمنون: 99: 100].وقال الغزالي رحمه الله تعالى: ابن آدم بدنه معه كالشبكة يكتسب بها الأعمال الصالحة، فإذا اكتسب خيراً ثم مات كفاه ولم يحتج بعد ذلك إلى الشبكة، وهو البدن الذي فارقه بالموت، ولا شك أن الإنسان إذا مات انقطعت شهوته من الدنيا واشتهت نفسه العمل الصالح لأنه زاد القبر، فإن كان معه استغنى به وإن لم يكن معه طلب الرجوع منها إلى الدنيا ليأخذ منها الزاد، وذلك بعد ما أخذت منه الشبكة فيقال له: هيهات قد فات! فيبقى متحيراً دائماً نادماً على تفريطه في أخذ الزاد قبل انتزاع الشبكة. \nفلهذا قال رسول الله ﷺ: وخذ من حياتك لموتك ». لا حول ولا قوة إلا بالله العلي العظيم ».",
    "hadith": "الحديث الأربعون\n\nعن ابن عمر رضي الله عنهما قال: أخذ رسول الله ﷺ بمنكبي فقال: \"كن في الدنيا كأنك غريب أو عابر سبيل، وكان ابن عمر رضي الله عنهما يقول: إذا أمسيت فلا تنتظر الصباح، وإذا أصبحت فلا تنتظر المساء، وخذ من صحتك لمرضك، ومن حياتك لموتك\". (رواه البخاري)"
  },
  {
    "description": "شرح وفوائد الحديث\nقوله ﷺ: « لا يؤمن أحدكم حتى يكون هواه تبعاً لما جئت به » يعني أن الشخص يجب عليه أن يعرض عمله على الكتاب والسنةويخالف هواه ويتبع ما جاء به ﷺ، وهذا نظير قوله تعالى: {وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمراً أن يكون لهم الخيرة من أمرهم} [الأحزاب: 36]. فليس لأحد مع الله عز وجل ورسوله ﷺ أمر ولا هوى. \nوعن إبراهيم بن محمد الكوفي قال: رأيت الشافعي بمكة يفتي الناس، ورأيت إسحاق بن راهويه وأحمد بن حنبل حاضرين، فقال أحمد لإسحاق: تعال حتى أريك رجلاً لم تر عيناك مثله. فقال له إسحاق: لم تر عيناي مثله؟! قل نعم ؛ فجاء به فوقفه على الشافعي فذكر القصة إلى أن قال: ثم تقدم إسحاق إلى مجلس الشافعي فسأله عن كراء بيوت مكة، فقال الشافعي: هذا عندنا جائز. قال رسول الله ﷺ: «فهل ترك لنا عقيل من دار »؟ فقال إسحاق: أخبرنا يزيد ابن هارون عن هشام عن الحسن أنه لم يكن يرى ذلك، وعطاء وطاووس لم يكونا يريان ذلك، فقال له الشافعي: أنت الذي تزعم أهل خرسان أنك فقيههم؟ قال إسحاق: كذا يزعمون! قال الشافعي: ما أحوجني أن يكون غيرك في موضعك فكنت آمراً بفرك أذنيه، أنا أقول: قال رسول الله ﷺ: وأنت تقول: قال عطاء وطاووس والحسن وإبراهيم، هؤلاء لا يرون ذلك؟ وهل لأحد مع رسول الله ﷺ حجة؟ ثم قال الشافعي: قال الله تعالى: {للفقراء المهاجرين الذين أخرجوا من ديارهم} [الحشر: 8]. أفتنسب الديار إلى مالكين أو غير مالكين؟ قال إسحاق: إلى مالكين. قال الشافعي: فقول الله تعالى أصدق الأقاويل. وقد قال رسول الله ﷺ: « من دخل دار أبي سفيان فهو آمن ». وقد اشترى عمر بن الخطاب رضي الله تعالى عنه دار الحجلتين. وذكر الشافعي جماعات من أصحاب رسول الله ﷺ، فقال له إسحاق: {سواء العاكف فيه والباد }[الحج: 25].فقال له الشافعي: فالمراد به المسجد خاصة، وهو الذي حول الكعبة ولو كان كما تزعم لكان لا يجوز لأحد أن ينشد في دور مكة ضالة، ولا تحبس فيها البدن، ولا تلقى الأرواث، ولكن هذا في المسجد خاصة، فسكت إسحاق ولم يتكلم فسكت الشافعي عنه.",
    "hadith": "الحديث الحادي والأربعون\n\nعن أبي محمد عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله ﷺ: \"لا يؤمن أحدكم حتى يكون هواه تبعاً لما جئت به\". (حديث حسن صحيح، رويناه في كتاب الحجة بإسناد صحيح)."
  },
  {
    "description": "شرح وفوائد الحديث\nقوله تعالى: «عنان السماء »، هو بفتح العين المهملة قيل هوالسحاب وقيل: ما عن لك منها، أي ظهر إذا رفعت رأسك. \nقوله تعالى: « ثم استغفرتني غفرت لك »، هو نظير قوله تعالى: {ومن يعمل سوءاً أو يظلم نفسه ثم يستغفر الله يجد الله غفوراً رحيماً }[النساء: 110]. الاستغفار لا بد أن يكون مقروناً بالتوبة. قال الله تعالى: {وأن استغفروا ربكم ثم توبوا إليه }[هود: 3].وقال تعالى: {وتوبوا إلى الله جمعياً أيها المؤمنون لعلكم تفلحون }[النور: 31]. \nواعلم أن الاستغفار معناه طلب المغفرة وهو استغفار المذنبين، وقد يكون عن تقصير في أداء الشكر؛ وهو استغفار الأولياء والصالحين، وقد يكون لا عن واحد منهما بل يكون شكراً وهو استغفاره ﷺ واستغفار الأنبياء عليهم الصلاة والسلام قال ﷺ: « سيد الاستغفار: الله أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استعطعت، أعوذ بك من شر ما صنعت أبوء لك بنعمتك على وأوبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت ». وقال ﷺ لأبي بكر رضي الله عنه: « قل اللهم إني ظلمت نفسي ظلماً كثيراً. وفي رواية ـ كبيراً ـ ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ».\nوهذا صلوا وسلموا على محمد وعلى آله وصحبه أجمعين",
    "hadith": "الحديث الثاني والأربعون\n\nعن أنس رضي الله عنه قال: سمعت رسول الله ﷺ يقول: \"قال الله تعالى: يا ابن آدم إنك ما دعوتني ورجوتني غفرت لك على ما كان منك ولا أبالي، يا ابن آدم لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك، يا ابن آدم إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئاً لأتيتك بقرابها مغفرة\". (رواه الترمذي، وقال: حديث حسن صحيح)."
  }
]